RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
/*
  Version 2: obstaculos, seguimiento de pasillo y telemetria de ronda.

  Prioridad de direccion:

    1. Si S3 detecta una pared demasiado cerca, el robot frena, centra
       el servo y retrocede hasta recuperar espacio.
    2. Mientras OpenMV vea un pilar valido, la camara controla el servo.
    3. Al perder el pilar, el servo vuelve gradualmente al objetivo que
       calcula el PID del pasillo.
    4. Sin pilar, los ultrasonicos laterales controlan normalmente el servo.

  El BNO085 no dirige: solo cuenta las vueltas de la mision.
*/

#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_BNO08x.h>
#include <WiFi.h>
#include <WebServer.h>
#include <esp_arduino_version.h>
#include <math.h>

// ====================================================================
//                  VARIABLES PARA CALIBRAR EL ROBOT
// ====================================================================

// ----------------------- Velocidad del motor ------------------------

constexpr uint8_t MOTOR_SPEED_PERCENT = 70; /////////////////////////////////speed
constexpr uint8_t MOTOR_CORNER_SPEED_PERCENT = 50; /////////////////////////////////speed

// Al detectar un pilar, limita inmediatamente la velocidad a este valor.
// Conforme el pilar se acerca, baja hasta MOTOR_CORNER_SPEED_PERCENT.
constexpr uint8_t MOTOR_PILLAR_FAR_SPEED_PERCENT = 70; ////////////////////////////////speed
constexpr bool INVERT_MOTOR_DIRECTION = true;

// Maniobra al detectar un color dentro de COLLISION_ROI.
constexpr uint8_t COLLISION_REVERSE_SPEED_PERCENT = 30;
constexpr unsigned long COLLISION_STOP_BEFORE_REVERSE_MS = 100;
constexpr uint16_t COLLISION_REVERSE_DISTANCE_MM = 100;
constexpr unsigned long COLLISION_REVERSE_MAX_MS = 1500;
constexpr uint8_t COLLISION_TRIGGER_CONFIRM_FRAMES = 2;
constexpr uint8_t COLLISION_CLEAR_CONFIRM_FRAMES = 3;

constexpr uint8_t MOTOR_PWM_PIN = D6;
constexpr uint8_t MOTOR_AIN2_PIN = D7;
constexpr uint8_t MOTOR_AIN1_PIN = D8;

// El interruptor del juez corta la potencia del motor, pero el ESP32 sigue
// preparando este PWM. La rampa comienza cuando el encoder confirma movimiento.
constexpr uint8_t MOTOR_START_DETECTION_PERCENT = 45;
constexpr uint8_t ENCODER_START_PULSES = 4;
constexpr unsigned long ENCODER_DETECTION_WINDOW_MS = 600;
constexpr unsigned long MOTOR_SOFT_START_DURATION_MS = 5000;
constexpr uint8_t ENCODER_A_PIN = D5;
constexpr uint8_t ENCODER_B_PIN = D9;

// Calibracion de 1 metro: prueba 1 = 3870, prueba 2 = 3988.
// Promedio = 3929 pulsos/m = 0.2545 mm por pulso.
constexpr float ENCODER_MM_PER_PULSE = 1000.0f / 3929.0f;
constexpr int8_t ODOMETRY_DIRECTION_STOPPED = 0;
constexpr int8_t ODOMETRY_DIRECTION_FORWARD = 1;
constexpr int8_t ODOMETRY_DIRECTION_REVERSE = -1;

// ----------------------- PID para el pasillo ------------------------

// S1 y S2: lado izquierdo. S3: frente. S4 y S5: lado derecho.
// Error = (S1*W1 + S2*W2) - (S4*W4 + S5*W5).
constexpr float SENSOR_WEIGHT_S1 = 1.0f;
constexpr float SENSOR_WEIGHT_S2 = 1.0f;
constexpr float SENSOR_WEIGHT_S4 = 1.0f;
constexpr float SENSOR_WEIGHT_S5 = 1.0f;

constexpr float CORRIDOR_KP = 0.12f;
constexpr float CORRIDOR_KI = 0.0015f;
constexpr float CORRIDOR_KD = 0.006f;
constexpr float CORRIDOR_INTEGRAL_LIMIT_DEGREES = 8.0f;
constexpr float CORRIDOR_DERIVATIVE_FILTER = 0.25f;

// Cambiar a 1 si el PID del pasillo gira al lado contrario.
constexpr int8_t CORRIDOR_SERVO_DIRECTION = -1;

constexpr uint16_t MAX_LATERAL_DISTANCE_MM = 1500;
constexpr uint16_t FRONT_CORNER_START_MM = 600;
constexpr uint16_t FRONT_CORNER_CRITICAL_MM = 180;
constexpr float CORNER_KP_MULTIPLIER = 1.8f;

// ---------------------- Direccion por OpenMV ------------------------

constexpr int OPENMV_X_MIN = -100;
constexpr int OPENMV_X_MAX = 100;

constexpr int LOW_ROI_CONE_FAR_Y = 130;
constexpr int LOW_ROI_CONE_NEAR_Y = 200;
constexpr int LOW_ROI_CONE_FAR_HALF_WIDTH = 30;
constexpr int LOW_ROI_CONE_NEAR_HALF_WIDTH = 65;

constexpr int HIGH_ROI_STEERING_GAIN_PERCENT = 200;
constexpr int LOW_ROI_EVASION_GAIN_PERCENT = 300;

// Cambiar a -1 si la direccion por camara gira al lado contrario.
constexpr int8_t OPENMV_SERVO_DIRECTION = 1;

// ------------------- Entrega camara -> ultrasonicos -----------------

// Despues de alcanzar ROI_LOW, el ID del pilar queda enclavado. La camara
// conserva el control hasta que los sensores del lado por el que se rebasa
// confirman el pilar. El bloqueo se conserva hasta que ese lado se despeja,
// para impedir que otro pilar mueva el servo antes de tiempo.
//
// Verde: el robot pasa por la izquierda y el pilar queda a su derecha (S4/S5).
// Rojo: el robot pasa por la derecha y el pilar queda a su izquierda (S1/S2).
constexpr uint16_t PILLAR_SIDE_DETECT_MM = 300;
constexpr uint16_t PILLAR_SIDE_CLEAR_MM = 360;
constexpr uint8_t PILLAR_SIDE_CONFIRM_SAMPLES = 2;

// Aunque el costado ya parezca libre, conserva el ID actual durante este
// tiempo continuo. Evita que una linea de esquina o el siguiente pilar cambien
// el objetivo inmediatamente despues del rebase.
constexpr unsigned long PILLAR_POST_CLEAR_HOLD_MS =100;    /////despues del pasarlo

// Al quedar el pilar junto al robot se deja de perseguir su ultima coordenada
// de camara, pero se conserva un giro moderado para terminar de rodearlo.
constexpr int PILLAR_WRAP_CORRECTION_DEGREES = 20;
constexpr uint8_t PILLAR_WRAP_SPEED_PERCENT = 35;

// El rodeo termina cuando los ultrasonicos de ese costado ven libre. Si lo
// que tienen enfrente es una pared y no el pilar, nunca ven libre: sin
// este tope el robot se queda girando contra la pared hasta chocar.
constexpr unsigned long PILLAR_WRAP_MAX_MS = 900;

// Con la pared de frente (S3 por debajo de FRONT_GUARD_ACTIVATE_MM) el
// pilar esta pegado a esa pared y rodearlo exige una maniobra mas larga:
// cortar a los 900 ms deja al robot atravesado. Mismo criterio que ya
// aplican FRONT_GUARD_HANDOFF_TIMEOUT_MS y
// FRONT_GUARD_LOCK_RELEASE_TIMEOUT_MS.
//
// El escape de pared de S3 a 15 cm sigue teniendo prioridad sobre esto,
// asi que alargar el rodeo no quita la proteccion contra el choque.
constexpr unsigned long FRONT_GUARD_WRAP_MAX_MS = 1600;

// Cambio de pilar (el caso verde -> rojo).
//
// Mientras un pilar esta enclavado, las tramas de OTRO color se ignoran
// por completo, pero el motor sigue dirigiendo hacia las ULTIMAS
// coordenadas del enclavado. Si el verde ya se rebaso y la camara solo ve
// rojo, el robot sigue girando hacia donde estaba el verde y se mete en la
// pared. Cuando el enclavado lleva este tiempo sin verse y la camara
// insiste con otro, se suelta el bloqueo para que el nuevo tome el mando.
//
// Nunca se abandona un rebase en curso: si el pilar enclavado sigue a la
// vista, su marca de tiempo se refresca y el cambio no se dispara.
constexpr unsigned long PILLAR_SWITCH_STALE_MS = 220;

// Durante el rodeo el pilar ya quedo al costado y la camara no lo ve, asi
// que ahi se exige mas espera antes de soltarlo.
constexpr unsigned long PILLAR_SWITCH_WRAP_STALE_MS = 450;

constexpr uint8_t PILLAR_SWITCH_CONFIRM_FRAMES = 3;

