RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Sentido propio de la fase de salida. En este montaje debe ser opuesto al
// signo usado para interpretar la correccion visual de aproximacion.
constexpr int8_t PILLAR_WRAP_DIRECTION = -1;

// Protecciones por si un ultrasonico no alcanza a ver el pilar. Primero se
// entrega el servo al PID del pasillo, pero se siguen ignorando pilares nuevos.
// Finalmente se libera el bloqueo para no quedar enclavado indefinidamente.
constexpr unsigned long PILLAR_SENSOR_HANDOFF_TIMEOUT_MS = 700;
constexpr unsigned long PILLAR_LOCK_RELEASE_TIMEOUT_MS = 1400;
constexpr unsigned long PILLAR_HIGH_LOSS_TIMEOUT_MS = 500;

// ---------- Proteccion lateral mientras dirige la camara ------------
//
// Mientras el pilar tiene el volante, el sketch ignora a proposito los
// ultrasonicos laterales: el robot esquiva hacia un lado aunque por ese
// lado haya pared, y solo S3 puede frenarlo de frente. Este limitador
// recorta el giro conforme se acerca la pared de ESE costado; el giro que
// aleja de la pared no se toca nunca.
//
// Es un compromiso: con el robot pegado a una pared el rodeo se recorta y
// puede rozar el pilar en vez de la pared. Subir SIDE_WALL_BLOCK_MM da mas
// margen a la pared; bajarlo deja esquivar mas.
constexpr bool PILLAR_SIDE_WALL_GUARD_ENABLED = true;

// Por encima de esta distancia el limitador no interviene.
constexpr uint16_t SIDE_WALL_FREE_MM = 300;

// A esta distancia el giro hacia esa pared queda anulado por completo.
constexpr uint16_t SIDE_WALL_BLOCK_MM = 130;

// Velocidad maxima mientras el limitador esta recortando el giro.
constexpr uint8_t SIDE_WALL_SPEED_PERCENT = 45;

// ---------------- Proteccion frontal cerca de la pared --------------

// Los cuadros de los pilares dejan aproximadamente 40 cm hasta la pared.
// S3 activa la proteccion debajo de esa distancia y la desactiva a 45 cm
// para evitar oscilaciones alrededor del umbral.
constexpr uint16_t FRONT_GUARD_ACTIVATE_MM = 400;
constexpr uint16_t FRONT_GUARD_RELEASE_MM = 450;
constexpr uint8_t FRONT_GUARD_CONFIRM_SAMPLES = 3;
constexpr uint8_t FRONT_GUARD_SPEED_PERCENT = 70; /////////////////////////////////speed
// Refuerzo del rodeo cuando la pared se acerca de frente con el pilar ya al
// costado. Antes era un valor fijo de 8 grados y se quedaba corto: al entrar
// a una esquina con un pilar al lado hay que cerrar mas para librarlo antes
// de llegar a la pared.
//
// Ahora crece con la cercania: a FRONT_GUARD_ACTIVATE_MM anade el minimo y a
// FRONT_GUARD_MAX_STEER_MM el maximo, sin escalones que den tirones.
constexpr int FRONT_GUARD_EXTRA_STEERING_DEGREES = 8;
constexpr int FRONT_GUARD_MAX_EXTRA_STEERING_DEGREES = 20;
constexpr uint16_t FRONT_GUARD_MAX_STEER_MM = 200;
constexpr unsigned long FRONT_GUARD_HANDOFF_TIMEOUT_MS = 1200;
constexpr unsigned long FRONT_GUARD_LOCK_RELEASE_TIMEOUT_MS = 2200;

// Escape de emergencia igual al de Open. Es independiente del refuerzo de
// evasion de 40 cm: solamente entra cuando S3 ya esta demasiado cerca.
constexpr uint16_t WALL_ESCAPE_TRIGGER_MM = 150;
constexpr uint16_t WALL_ESCAPE_CLEAR_MM = 250;
constexpr uint8_t WALL_ESCAPE_REVERSE_SPEED_PERCENT = 45;
constexpr unsigned long WALL_ESCAPE_BRAKE_MS = 150;
constexpr unsigned long WALL_ESCAPE_MAX_REVERSE_MS = 2500;

// Al perder un pilar, esta velocidad limita el regreso al PID del pasillo.
// Un valor menor hace la transicion mas suave; uno mayor la hace mas rapida.
constexpr float CORRIDOR_RETURN_RATE_DEGREES_PER_SECOND = 45.0f;

// La entrega gradual existe para que el volante no pegue un tiron al pasar
// de la camara a los sensores. Entrando a una esquina es justo lo contrario
// de lo que hace falta: el robot tiene que girar ya, y limitarlo a 45
// grados por segundo lo manda contra la pared exterior. Con la pared de
// frente, o pasado este tiempo, el PID toma el volante de golpe.
constexpr uint16_t CORRIDOR_RETURN_ABORT_FRONT_MM = 700;
constexpr unsigned long CORRIDOR_RETURN_MAX_MS = 700;

// ----------------------------- Servo --------------------------------

constexpr uint8_t SERVO_PIN = 27;  // D4 / GPIO27
constexpr int SERVO_CENTER_DEGREES = 90;
constexpr int SERVO_MAX_CORRECTION_DEGREES = 40;
constexpr uint16_t SERVO_MIN_PULSE_US = 500;
constexpr uint16_t SERVO_MAX_PULSE_US = 2500;

// ----------------------- Iluminacion automatica ---------------------

// Luz durante el estacionamiento. Es un valor ABSOLUTO y manda sobre el
// ajuste automatico mientras dura la maniobra, asi que un 0 aqui APAGA los
// LEDs justo cuando el robot va a buscar las paredes.
//
// Se deja igual que la luz de las vueltas: asi los umbrales de la camara se
// calibran una sola vez y nada cambia bajo sus pies al entrar a la maniobra.
constexpr uint8_t PARKING_LED_BRIGHTNESS_PERCENT = 50;

// Brillo de las vueltas. Subido de 30 a 70: con luz alta los tres colores
// se separan mucho mejor en LAB.
//
// Los dos valores iguales dejan la luz fija, sin atenuar al acercarse.
//
// OJO: los umbrales de rojo y verde hay que calibrarlos CON ESTA LUZ.
constexpr uint8_t LED_BRIGHTNESS_FAR_PERCENT = 50;
constexpr uint8_t LED_BRIGHTNESS_NEAR_PERCENT = 50;
constexpr uint8_t LED_RETURN_STEP_PERCENT = 1;
constexpr unsigned long LED_RETURN_INTERVAL_MS = 30;

constexpr int PILLAR_FAR_Y = 70;
constexpr int PILLAR_NEAR_Y = 190;

// S3 complementa la altura aparente del pilar. La camara confirma que hay
// un pilar y estas distancias convierten la lectura frontal a intensidad.
constexpr uint16_t LED_FRONT_FAR_MM = 600;
constexpr uint16_t LED_FRONT_NEAR_MM = 100;
constexpr unsigned long FRONT_DISTANCE_FRESH_MS = 150;

// ------------------ Estacionamiento final ---------------------------
//
// Al completar las vueltas el robot no se detiene: busca el hueco entre
// las dos paredes magenta y entra de reversa.
//
// Secuencia: BUSCA -> ACOMPANA -> REBASA -> FRENA -> ENTRA -> ENDEREZA.
//
// De que lado esta el hueco NO se deduce del sentido de la vuelta: la
// camara ya lo dice directamente con el signo de parkingX, que es
// evidencia directa y no depende de cual sea el convenio del BNO085.
// El sentido de giro queda solo como respaldo si la camara nunca lo vio.
constexpr bool PARKING_ENABLED = true;

// Area minima de la pared para darla por vista de verdad. Filtra destellos
// lejanos que aparecen y desaparecen.
constexpr int16_t PARKING_MIN_AREA = 250;
constexpr uint8_t PARKING_SEEN_FRAMES = 3;
constexpr uint8_t PARKING_LOST_FRAMES = 6;

