RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Cuantas paredes hay que dejar atras antes de frenar. Dos es lo normal:
// se rebasa la primera, luego la segunda, y el hueco queda al costado.
// Ponlo en 1 si en la camara las dos paredes se fusionan en un solo blob.
constexpr uint8_t PARKING_WALLS_TO_PASS = 2;

// Velocidades de la maniobra.
//
// Buscar y acercarse son cosas distintas. Al salir de la tercera vuelta el
// hueco puede estar en cualquier punto del circuito, asi que puede hacer
// falta recorrer una vuelta entera para encontrarlo: ir despacio ahi solo
// gasta el tiempo de la ronda. Una vez que la pared esta a la vista si
// conviene bajar, porque ahi cada centimetro cuenta.
constexpr uint8_t PARKING_SEARCH_SPEED_PERCENT = 50;
constexpr uint8_t PARKING_APPROACH_SPEED_PERCENT = 45;
constexpr uint8_t PARKING_REVERSE_SPEED_PERCENT = 32;

// Sesgo del volante para arrimarse a la pared exterior mientras busca el
// hueco. Se aplica sobre el PID de pasillo, no en su lugar: el robot sigue
// esquivando paredes, solo que rueda mas cerca del lado donde debe estar el
// estacionamiento.
//
// Subirlo lo pega mas a esa pared; pasarse hace que el PID pelee contra el
// sesgo y el robot vaya en diagonal.
constexpr int PARKING_SIDE_BIAS_DEGREES = 10;

// Tras perder de vista la ultima pared, el hueco todavia queda adelante:
// la pared sale del campo de vision antes de que el robot llegue a su
// altura. Este avance por encoder cubre esa diferencia.
constexpr uint16_t PARKING_PASS_DISTANCE_MM = 260;

// Reversa en dos tramos, como un estacionamiento en paralelo: primero
// entra girando hacia el hueco, luego contravolantea para enderezarse.
constexpr uint16_t PARKING_REVERSE_TURN_MM = 240;
constexpr uint16_t PARKING_REVERSE_STRAIGHT_MM = 150;
constexpr int PARKING_REVERSE_STEER_DEGREES = 34;
constexpr int PARKING_STRAIGHTEN_STEER_DEGREES = 26;

constexpr unsigned long PARKING_BRAKE_MS = 250;

// Topes de seguridad. Sin sensor trasero, la reversa se acota por encoder
// y por tiempo; si algo se atasca, el robot para y da por terminada la
// ronda en vez de seguir empujando.
// Durante el estacionamiento el failsafe de sensores esta desactivado a
// proposito, para que un hueco de I2C no corte la reversa. Pero si el Nano
// lleva mudo este tiempo, ya no es un hueco: es una averia.
constexpr unsigned long PARKING_SENSOR_MUTE_ABORT_MS = 1500;

constexpr unsigned long PARKING_PHASE_MAX_MS = 6000;

// Tiene que alcanzar para una vuelta completa a velocidad de busqueda: el
// hueco puede quedar justo detras del punto donde se cumplen las 3 vueltas.
// Medido en pista: ~40 s por vuelta al 90% de motor, o sea ~52 s al 70%.
constexpr unsigned long PARKING_TOTAL_MAX_MS = 70000;

// Distancia lateral con la que se confirma que el costado quedo libre: es
// el hueco entre las dos paredes.
constexpr uint16_t PARKING_GAP_SIDE_MM = 300;

// Respaldo por si la camara nunca llega a ver las paredes. En una vuelta
// ANTIHORARIA el bloque central queda a la izquierda y la pared exterior
// a la derecha, asi que el hueco esta a la derecha.
//
// PARKING_CCW_YAW_SIGN es el signo del giro acumulado del BNO085 que
// corresponde a una vuelta antihoraria. Cambialo a -1 si el robot elige
// el lado contrario cuando la camara no vio nada.
constexpr bool PARKING_SIDE_FROM_TURN_FALLBACK = true;
constexpr int8_t PARKING_CCW_YAW_SIGN = 1;

// ---------------------- BNO085, vueltas y dashboard ----------------

constexpr uint8_t BNO085_I2C_ADDRESS_PRIMARY = 0x4B;
constexpr uint8_t BNO085_I2C_ADDRESS_SECONDARY = 0x4A;
constexpr uint32_t BNO085_REPORT_INTERVAL_US = 10000;
constexpr unsigned long BNO085_FAILSAFE_TIMEOUT_MS = 500;

// El BNO085 solo se intentaba iniciar una vez, en setup(). Si no respondia en
// ese instante, o fallaba una sola vez a media ronda, quedaba muerto para el
// resto de la ronda: sin rumbo no se cuentan vueltas, y sin vueltas nunca
// arranca el estacionamiento.
//
// Parado se reintenta seguido, que no cuesta nada. Ya rodando se reintenta
// espaciado, porque begin_I2C bloquea unos cientos de milisegundos y eso se
// nota en el control del pasillo.
constexpr unsigned long BNO085_RETRY_STOPPED_MS = 1000;
constexpr unsigned long BNO085_RETRY_RUNNING_MS = 5000;

// Detectado pero mudo: se fuerza un reinicio en vez de esperar sin fin.
constexpr unsigned long BNO085_STALL_TIMEOUT_MS = 2000;
constexpr bool REQUIRE_BNO085_TO_MOVE = false;
constexpr uint8_t TARGET_LAPS = 3;
constexpr float DEGREES_PER_LAP = 360.0f;
constexpr float MAX_HEADING_STEP_DEGREES = 90.0f;



// true en pruebas; cambiar a false para apagar completamente el WiFi en ronda.
constexpr bool DASHBOARD_ENABLED = true;
constexpr char DASHBOARD_WIFI_NAME[] = "WRO-Obstaculos-V2";
constexpr char DASHBOARD_WIFI_PASSWORD[] = "wroobst26";

// ====================================================================
//                    FIN DE VARIABLES DE CALIBRACION
// ====================================================================

// -------------------------- Comunicaciones --------------------------

constexpr uint8_t OPENMV_RX_PIN = 25;
constexpr uint8_t OPENMV_TX_PIN = 26;
constexpr uint32_t OPENMV_BAUD = 19200;
constexpr unsigned long OPENMV_TIMEOUT_MS = 500;

// Devuelve a la OpenMV el estado que realmente esta aplicando el ESP32 para
// que pueda dibujar una vista previa. No cambia el control del robot.
constexpr bool OPENMV_PATH_TELEMETRY_ENABLED = false;
constexpr unsigned long OPENMV_PATH_TELEMETRY_INTERVAL_MS = 50;

// Aviso a la camara de cuando buscar el estacionamiento: "P,1" lo enciende y
// "P,0" lo apaga. Se repite como latido para que la camara quede en el estado
// correcto aunque se reinicie a media ronda o se pierda una linea.
constexpr unsigned long OPENMV_PARKING_MODE_INTERVAL_MS = 250;

// true: la camara busca las paredes desde el arranque, toda la ronda.
// false: solo las busca al completar las vueltas.
//
// Buscar siempre cuesta una busqueda de blobs mas por cuadro, pero no cambia
// el comportamiento del robot: el ESP32 ignora los campos de estacionamiento
// hasta que el mismo decide que toca aparcar.
constexpr bool OPENMV_PARKING_ALWAYS_SEARCH = true;

// ------------------ Robustez de la trama OpenMV ---------------------

// Campos aceptados por trama. 6 = firmware anterior (sin pared negra),
// 7 = firmware 5, 10 = firmware 5 con estacionamiento. Los campos extra
// se ignoran sin invalidar la linea, para que una actualizacion de la
// camara no deje ciego al ESP32.
constexpr int OPENMV_MIN_FIELDS = 6;
constexpr int OPENMV_MAX_FIELDS = 10;

// Debe coincidir con X_AS_NORMALIZED del script de la OpenMV.
// true:  la camara ya envia X entre -100 y 100.
// false: la camara envia X en pixeles y el ESP32 la convierte aqui.
constexpr bool OPENMV_X_IS_NORMALIZED = true;
constexpr long OPENMV_IMAGE_WIDTH_PX = 320;
constexpr long OPENMV_IMAGE_HEIGHT_PX = 240;

// Margen tolerado antes de recortar X. Un desvio mayor no es redondeo:
// indica trama corrupta o modo de X equivocado, y se rechaza.
constexpr long OPENMV_X_TOLERANCE = 5;

// Tope de lineas atendidas por vuelta de loop(): una rafaga acumulada
// no debe retrasar los sensores ni el servo.
constexpr uint8_t OPENMV_MAX_LINES_PER_LOOP = 8;

