RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Si el buffer de recepcion supera este tamano, el loop se retraso y las
// tramas guardadas ya no describen lo que la camara ve ahora. Dirigir
// con una imagen vieja es peor que perder cuadros: se descartan.
constexpr int OPENMV_MAX_BACKLOG_BYTES = 128;

// Agrupa los avisos de trama invalida. Imprimir cada una bloquea el loop
// cuando se llena el buffer de Serial.
constexpr unsigned long OPENMV_INVALID_LOG_INTERVAL_MS = 1000;

// El buffer por defecto (256 bytes) se llena si el loop tarda de mas y
// entonces se pierden tramas por la mitad.
constexpr size_t OPENMV_RX_HARDWARE_BUFFER_BYTES = 512;

HardwareSerial openMVSerial(2);

constexpr uint8_t NANO_I2C_ADDRESS = 0x08;
constexpr uint8_t SENSOR_COUNT = 5;
constexpr uint8_t DISTANCE_PACKET_BYTES = SENSOR_COUNT * 2;
constexpr uint16_t INVALID_DISTANCE_MM = 0xFFFF;
constexpr uint16_t NO_ECHO_DISTANCE_MM = 2000;

constexpr uint8_t ESP32_SDA_PIN = 21;
constexpr uint8_t ESP32_SCL_PIN = 22;
// Bajado de 100 kHz a 50 kHz por margen de ruido.
//
// El Nano es de 5 V y su umbral de HIGH es 0.6 x Vcc = 3.00 V, pero el bus lo
// levantan pull-ups a 3.3 V: solo 0.30 V de margen. Con los picos de corriente
// de los NeoPixels y del motor, ese margen se cruza y el Nano lee mal un bit,
// que es como se traba el bus aunque cada cosa tenga su regulador (el rebote
// es de MASA, no del rail).
//
// A menos velocidad los flancos tienen mas tiempo de asentarse. El paquete son
// 10 bytes cada 20 ms, asi que sobra ancho de banda.
constexpr uint32_t I2C_FREQUENCY_HZ = 50000;

// Un bus trabado no debe bloquear el loop en cada intento.
constexpr uint16_t I2C_TIMEOUT_MS = 10;

constexpr unsigned long SENSOR_POLL_INTERVAL_MS = 20;
constexpr unsigned long SENSOR_FAILSAFE_TIMEOUT_MS = 250;

// Si el Nano se calla, reiniciar el bus I2C cada tanto. Un Nano que se
// reinicia por caida de tension vuelve solo, pero un bus trabado (SDA
// enganchado a bajo) no se suelta sin volver a inicializar el maestro.
//
// Mismo criterio que el reintento del BNO085: rendirse en silencio es lo
// unico que no se puede permitir en una ronda.
constexpr unsigned long I2C_RECOVERY_INTERVAL_MS = 2000;
constexpr unsigned long SERIAL_PRINT_INTERVAL_MS = 500;

// Evita que el primer paquete despues de una pausa produzca un paso grande.
constexpr unsigned long MAX_BLEND_STEP_INTERVAL_MS = 50;

constexpr uint32_t SERVO_PWM_FREQUENCY_HZ = 50;
constexpr uint8_t SERVO_PWM_RESOLUTION_BITS = 16;
constexpr uint32_t MOTOR_PWM_FREQUENCY_HZ = 20000;
constexpr uint8_t MOTOR_PWM_RESOLUTION_BITS = 10;

#if ESP_ARDUINO_VERSION_MAJOR < 3
constexpr uint8_t SERVO_PWM_CHANNEL = 0;
constexpr uint8_t MOTOR_PWM_CHANNEL = 1;
#endif

static_assert(CORRIDOR_SERVO_DIRECTION == 1 ||
                  CORRIDOR_SERVO_DIRECTION == -1,
              "CORRIDOR_SERVO_DIRECTION debe ser 1 o -1");
static_assert(OPENMV_SERVO_DIRECTION == 1 ||
                  OPENMV_SERVO_DIRECTION == -1,
              "OPENMV_SERVO_DIRECTION debe ser 1 o -1");
static_assert(FRONT_CORNER_START_MM > FRONT_CORNER_CRITICAL_MM,
              "La distancia inicial debe ser mayor que la critica");
static_assert(MOTOR_SPEED_PERCENT >= MOTOR_CORNER_SPEED_PERCENT,
              "La velocidad normal no puede ser menor que la de esquina");
static_assert(MOTOR_SPEED_PERCENT >= MOTOR_PILLAR_FAR_SPEED_PERCENT &&
                  MOTOR_PILLAR_FAR_SPEED_PERCENT >=
                      MOTOR_CORNER_SPEED_PERCENT,
              "La velocidad de pilar debe quedar entre normal y minima");
static_assert(CORRIDOR_RETURN_RATE_DEGREES_PER_SECOND > 0.0f,
              "La velocidad de retorno debe ser positiva");
static_assert(LED_FRONT_FAR_MM > LED_FRONT_NEAR_MM,
              "La distancia lejana de luz debe superar la cercana");
static_assert(PILLAR_SIDE_CLEAR_MM > PILLAR_SIDE_DETECT_MM,
              "La distancia de despeje debe superar la de deteccion");
static_assert(PILLAR_SIDE_CONFIRM_SAMPLES > 0,
              "La deteccion lateral necesita muestras de confirmacion");
static_assert(PILLAR_WRAP_CORRECTION_DEGREES > 0 &&
                  PILLAR_WRAP_CORRECTION_DEGREES <=
                      SERVO_MAX_CORRECTION_DEGREES,
              "El giro de rodeo debe caber en el recorrido del servo");
static_assert(PILLAR_WRAP_SPEED_PERCENT > 0 &&
                  PILLAR_WRAP_SPEED_PERCENT <= 100,
              "La velocidad de rodeo debe quedar entre 1 y 100");
static_assert(PILLAR_WRAP_DIRECTION == 1 ||
                  PILLAR_WRAP_DIRECTION == -1,
              "PILLAR_WRAP_DIRECTION debe ser 1 o -1");
static_assert(PILLAR_LOCK_RELEASE_TIMEOUT_MS >
                  PILLAR_SENSOR_HANDOFF_TIMEOUT_MS,
              "El desbloqueo debe ocurrir despues del handoff de seguridad");
static_assert(FRONT_GUARD_RELEASE_MM > FRONT_GUARD_ACTIVATE_MM,
              "La salida de proteccion debe superar la entrada");
static_assert(FRONT_GUARD_MAX_STEER_MM < FRONT_GUARD_ACTIVATE_MM,
              "El refuerzo maximo debe quedar mas cerca que la activacion");
static_assert(FRONT_GUARD_MAX_EXTRA_STEERING_DEGREES >=
                  FRONT_GUARD_EXTRA_STEERING_DEGREES,
              "El refuerzo maximo no puede ser menor que el minimo");
// Con el refuerzo al maximo, el rodeo debe seguir cabiendo en el servo: si se
// pasara, los ultimos grados se recortarian en silencio y el valor de la
// constante dejaria de significar lo que dice.
static_assert(PILLAR_WRAP_CORRECTION_DEGREES +
                  FRONT_GUARD_MAX_EXTRA_STEERING_DEGREES <=
                      SERVO_MAX_CORRECTION_DEGREES,
              "El rodeo con refuerzo maximo no cabe en el recorrido del servo");
static_assert(SIDE_WALL_FREE_MM > SIDE_WALL_BLOCK_MM,
              "La distancia libre lateral debe superar la de bloqueo");
static_assert(PILLAR_WRAP_MAX_MS > 0,
              "El rodeo necesita un tope de tiempo");
static_assert(FRONT_GUARD_WRAP_MAX_MS >= PILLAR_WRAP_MAX_MS,
              "Con pared de frente el rodeo no puede durar menos");
static_assert(PILLAR_SWITCH_CONFIRM_FRAMES > 0,
              "El cambio de pilar necesita tramas de confirmacion");
static_assert(PILLAR_SWITCH_WRAP_STALE_MS >= PILLAR_SWITCH_STALE_MS,
              "Durante el rodeo la espera no puede ser menor");
static_assert(CORRIDOR_RETURN_ABORT_FRONT_MM > FRONT_CORNER_CRITICAL_MM,
              "La entrega inmediata debe ocurrir antes de la distancia critica");
static_assert(CORRIDOR_RETURN_MAX_MS > 0,
              "La entrega gradual necesita un tope de tiempo");
static_assert(SIDE_WALL_SPEED_PERCENT > 0 &&
                  SIDE_WALL_SPEED_PERCENT <= 100,
              "La velocidad junto a la pared debe quedar entre 1 y 100");
static_assert(FRONT_GUARD_CONFIRM_SAMPLES > 0,
              "La proteccion frontal necesita muestras de confirmacion");
static_assert(FRONT_GUARD_LOCK_RELEASE_TIMEOUT_MS >
                  FRONT_GUARD_HANDOFF_TIMEOUT_MS,
              "El desbloqueo frontal debe ocurrir despues del handoff");
static_assert(WALL_ESCAPE_CLEAR_MM > WALL_ESCAPE_TRIGGER_MM,
              "La salida del escape debe superar la entrada");
static_assert(WALL_ESCAPE_REVERSE_SPEED_PERCENT > 0 &&
                  WALL_ESCAPE_REVERSE_SPEED_PERCENT <= 100,
              "La reversa de pared debe quedar entre 1 y 100");
static_assert(WALL_ESCAPE_BRAKE_MS > 0 &&
                  WALL_ESCAPE_MAX_REVERSE_MS > 0,
              "Los tiempos del escape de pared deben ser positivos");
static_assert(COLLISION_REVERSE_SPEED_PERCENT > 0 &&
                  COLLISION_REVERSE_SPEED_PERCENT <= 100,
              "La velocidad de reversa debe quedar entre 1 y 100");
static_assert(COLLISION_TRIGGER_CONFIRM_FRAMES > 0,
              "Se necesita al menos una trama para confirmar la colision");
static_assert(COLLISION_CLEAR_CONFIRM_FRAMES > 0,
              "Se necesita al menos una trama para despejar la colision");
static_assert(COLLISION_REVERSE_DISTANCE_MM > 0 &&
                  COLLISION_REVERSE_MAX_MS > 0,
              "La reversa de colision necesita distancia y timeout");
static_assert(MOTOR_START_DETECTION_PERCENT > 0 &&
                  MOTOR_START_DETECTION_PERCENT <= 100,
              "El PWM inicial debe quedar entre 1 y 100");
static_assert(ENCODER_START_PULSES > 0,
              "El encoder necesita al menos un pulso de confirmacion");
static_assert(ENCODER_MM_PER_PULSE > 0.0f,
              "La calibracion del encoder debe ser positiva");
static_assert(TARGET_LAPS > 0,
              "La mision necesita al menos una vuelta");
static_assert(PARKING_WALLS_TO_PASS > 0,
              "Hay que rebasar al menos una pared");
static_assert(PARKING_LED_BRIGHTNESS_PERCENT <= 100,
              "La luz de estacionamiento va entre 0 y 100");
static_assert(PARKING_CCW_YAW_SIGN == 1 || PARKING_CCW_YAW_SIGN == -1,
              "PARKING_CCW_YAW_SIGN debe ser 1 o -1");
static_assert(PARKING_SEEN_FRAMES > 0 && PARKING_LOST_FRAMES > 0,
              "El conteo de paredes necesita tramas de confirmacion");
static_assert(PARKING_REVERSE_SPEED_PERCENT > 0 &&
                  PARKING_REVERSE_SPEED_PERCENT <= 100,
              "La reversa de estacionamiento va entre 1 y 100");
static_assert(PARKING_SEARCH_SPEED_PERCENT >= PARKING_APPROACH_SPEED_PERCENT,
              "Buscar no puede ser mas lento que acercarse");
static_assert(PARKING_REVERSE_STEER_DEGREES <=
                  SERVO_MAX_CORRECTION_DEGREES &&
              PARKING_STRAIGHTEN_STEER_DEGREES <=
                  SERVO_MAX_CORRECTION_DEGREES,
              "El giro de estacionamiento debe caber en el servo");
static_assert(PARKING_TOTAL_MAX_MS > PARKING_PHASE_MAX_MS,
              "El tope total debe superar al de una fase");

// ----------------------------- Estados ------------------------------

