RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
struct OpenMVData {
  int16_t detectedId;
  int16_t xReference;
  int16_t yReference;
  int16_t areaPixels;
  int16_t roiCode;
  int16_t collisionId;
  int16_t wallBlack;
  // Pared del estacionamiento (magenta y ancha). La camara la separa del
  // pilar por su forma: 20x10 cm da ancho/alto = 2, el pilar 5x10 cm da
  // alto/ancho = 2.
  int16_t parkingDetected;
  int16_t parkingX;
  int16_t parkingArea;
  unsigned long receivedAtMs;
};

struct CorridorControlState {
  float leftValue;
  float rightValue;
  float error;
  float effectiveKp;
  float pTerm;
  float iTerm;
  float dTerm;
  float cornerFactor;
  int targetServoAngle;
  int appliedServoAngle;
  uint8_t speedPercent;
};

OpenMVData openMVData = {0, -1, -1, 0, 0, 0, 0, 0, 0, 0, 0};

constexpr size_t RX_BUFFER_SIZE = 64;
char rxBuffer[RX_BUFFER_SIZE];
size_t rxLength = 0;
bool discardingLongLine = false;
unsigned long invalidFrameCount = 0;
unsigned long lastInvalidFrameLogMs = 0;
// Acumulado desde el arranque; se muestra en el tablero para ver de un
// vistazo si el enlace con la camara esta sano.
unsigned long totalInvalidFrames = 0;

bool servoReady = false;
bool motorReady = false;
bool communicationTimedOut = false;
bool pillarHasSteeringControl = false;
bool corridorReturnActive = false;
unsigned long corridorReturnStartMs = 0;

bool pillarLockActive = false;
int16_t lockedPillarId = 0;
OpenMVData lockedPillarData = {0, -1, -1, 0, 0, 0, 0, 0, 0, 0, 0};
bool lockedPillarReachedLowRoi = false;
bool lockedPillarSeenBySideSensors = false;
// Momento en que arranco la fase de rodeo, para poder acotarla.
unsigned long pillarWrapStartMs = 0;
// Tramas seguidas viendo un pilar de otro color con el enclavado perdido.
uint8_t pillarSwitchFrames = 0;
uint8_t pillarSideDetectSamples = 0;
uint8_t pillarSideClearSamples = 0;
unsigned long lastLockedPillarSeenMs = 0;
unsigned long pillarSideClearSinceMs = 0;

// El hueco queda a la izquierda o a la derecha del robot. -1 izquierda,
// +1 derecha, 0 aun sin saber.
enum class ParkingState : uint8_t {
  IDLE,          // Todavia dando vueltas.
  SEARCH,        // Vueltas hechas, buscando las paredes.
  PASSING,       // Contando paredes rebasadas.
  ALIGNING,      // Avance final por encoder hasta quedar junto al hueco.
  BRAKING,       // Alto antes de invertir el sentido.
  REVERSE_TURN,  // Entra de reversa girando hacia el hueco.
  REVERSE_STRAIGHT,  // Contravolantea para enderezarse.
  DONE
};

ParkingState parkingState = ParkingState::IDLE;
unsigned long parkingStateStartMs = 0;
unsigned long parkingStartedMs = 0;
uint32_t parkingPhaseStartPulses = 0;
// -1 izquierda, +1 derecha, 0 aun sin determinar.
int8_t parkingSide = 0;
// Distingue el final bueno del que se rindio: el tablero decia
// "estacionado" tambien cuando la maniobra fracasaba.
bool parkingSucceeded = false;
const char *parkingFinishReason = "";
uint8_t parkingWallsPassed = 0;
uint8_t parkingSeenFrames = 0;
uint8_t parkingLostFrames = 0;
bool parkingWallInSight = false;

bool frontGuardActive = false;
uint8_t frontGuardNearSamples = 0;
// Lo pone limitSteeringBySideWall() en cada calculo del angulo de pilar.
bool sideWallGuardActive = false;
uint16_t sideWallGuardDistanceMm = INVALID_DISTANCE_MM;
uint8_t frontGuardClearSamples = 0;

enum class CollisionRecoveryState : uint8_t {
  IDLE,
  STOPPING,
  REVERSING,
  WAITING_FOR_CLEAR
};

enum class WallEscapeState : uint8_t {
  IDLE,
  BRAKING,
  REVERSING,
  WAITING_FOR_CLEAR
};

enum class MotorStartupState : uint8_t {
  WAITING_FOR_MOVEMENT,
  RAMPING,
  RUNNING
};

CollisionRecoveryState collisionRecoveryState =
    CollisionRecoveryState::IDLE;
unsigned long collisionRecoveryStateStartMs = 0;
uint32_t collisionReverseStartPulses = 0;
uint8_t collisionTriggerFrames = 0;
uint8_t collisionClearFrames = 0;
int16_t collisionRecoveryColorId = 0;

WallEscapeState wallEscapeState = WallEscapeState::IDLE;
unsigned long wallEscapeStateStartMs = 0;

float currentServoAngleDegrees = SERVO_CENTER_DEGREES;
int lastWrittenServoAngle = -1;
unsigned long lastCorridorBlendStepMs = 0;

uint8_t targetMotorSpeedPercent = 0;
uint8_t appliedMotorSpeedPercent = 0;

volatile uint32_t encoderPulseCount = 0;
MotorStartupState motorStartupState =
    MotorStartupState::WAITING_FOR_MOVEMENT;
uint32_t encoderDetectionBaseline = 0;
unsigned long encoderDetectionWindowStartMs = 0;
unsigned long motorRampStartMs = 0;
bool encoderDetectionWindowActive = false;

int8_t odometryMotorDirection = ODOMETRY_DIRECTION_STOPPED;
uint32_t odometryLastPulseCount = 0;
bool odometryHasOrigin = false;
float odometryHeadingOriginDegrees = 0.0f;
float odometryXmm = 0.0f;
float odometryYmm = 0.0f;
float odometrySignedDistanceMm = 0.0f;
float odometryTravelDistanceMm = 0.0f;

Adafruit_BNO08x bno085(-1);
sh2_SensorValue_t bno085SensorValue;
bool bno085Initialized = false;
bool bno085HasHeading = false;
bool bno085FailsafeActive = false;
uint8_t bno085I2cAddressDetected = 0;
float currentYawDegrees = 0.0f;
float previousYawDegrees = 0.0f;
float accumulatedTurnDegrees = 0.0f;
uint8_t completedLaps = 0;
unsigned long lastBno085FrameMs = 0;
unsigned long lastBno085RetryMs = 0;
bool lapTrackingActive = false;


bool missionComplete = false;

bool roundTimerStarted = false;
unsigned long roundStartMs = 0;
unsigned long roundFinishMs = 0;

bool distanceSensorFailsafeActive = false;
uint16_t latestDistancesMm[SENSOR_COUNT] = {
    NO_ECHO_DISTANCE_MM,
    NO_ECHO_DISTANCE_MM,
    NO_ECHO_DISTANCE_MM,
    NO_ECHO_DISTANCE_MM,
    NO_ECHO_DISTANCE_MM
};

WebServer dashboardServer(80);

float pidIntegralError = 0.0f;
float pidPreviousError = 0.0f;
float pidFilteredDerivative = 0.0f;
unsigned long pidPreviousUpdateUs = 0;
bool pidHasPreviousSample = false;

int currentLedBrightnessPercent = -1;
int targetLedBrightnessPercent = LED_BRIGHTNESS_FAR_PERCENT;
unsigned long lastLedReturnStepMs = 0;
bool ledI2cErrorReported = false;

uint16_t latestFrontDistanceMm = INVALID_DISTANCE_MM;
unsigned long latestFrontDistanceAtMs = 0;
// Ultimo paquete I2C valido del Nano. Global para poder mostrar su edad
// en el tablero: sin cable no hay forma de ver esto en una ronda.
unsigned long lastValidSensorMs = 0;
unsigned long lastI2cRecoveryMs = 0;

// ------------------ Encoder, BNO085, vueltas y tiempo --------------

void IRAM_ATTR handleEncoderAPulse() {
  __atomic_fetch_add(&encoderPulseCount, 1U, __ATOMIC_RELAXED);
}

uint32_t readEncoderPulseCount() {
  return __atomic_load_n(&encoderPulseCount, __ATOMIC_RELAXED);
}

