RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
void beginEncoder() {
  pinMode(ENCODER_A_PIN, INPUT);
  pinMode(ENCODER_B_PIN, INPUT);
  encoderDetectionBaseline = readEncoderPulseCount();
  attachInterrupt(
      digitalPinToInterrupt(ENCODER_A_PIN),
      handleEncoderAPulse,
      RISING
  );
}

void resetMotorStartupDetection() {
  motorStartupState = MotorStartupState::WAITING_FOR_MOVEMENT;
  encoderDetectionBaseline = readEncoderPulseCount();
  encoderDetectionWindowStartMs = 0;
  motorRampStartMs = 0;
  encoderDetectionWindowActive = false;
}

unsigned long roundElapsedMs() {
  if (!roundTimerStarted) {
    return 0;
  }

  const unsigned long endMs =
      missionComplete ? roundFinishMs : millis();
  return endMs - roundStartMs;
}

float normalizeHeadingDelta(float deltaDegrees) {
  while (deltaDegrees > 180.0f) deltaDegrees -= 360.0f;
  while (deltaDegrees < -180.0f) deltaDegrees += 360.0f;
  return deltaDegrees;
}



void finishMission() {
  if (missionComplete) {
    return;
  }

  // Con el estacionamiento activo la ronda NO termina al completar las
  // vueltas: el robot sigue rodando para buscar el hueco. La ronda la
  // cierra finishParking() al quedar dentro del cajon.
  if (PARKING_ENABLED && parkingState == ParkingState::IDLE) {
    completedLaps = TARGET_LAPS;
    beginParking(millis());
    return;
  }

  if (parkingActive()) {
    return;
  }

  missionComplete = true;
  completedLaps = TARGET_LAPS;
  if (roundTimerStarted) {
    roundFinishMs = millis();
  }
  stopMotor();
  commandServoAngle(SERVO_CENTER_DEGREES);
  Serial.println("*** 3 VUELTAS: MISION DE OBSTACULOS TERMINADA ***");
}

void processBno085Heading(float yawDegrees, unsigned long nowMs) {
  currentYawDegrees = yawDegrees;
  lastBno085FrameMs = nowMs;
  bno085FailsafeActive = false;

  if (!bno085HasHeading) {
    bno085HasHeading = true;
    previousYawDegrees = yawDegrees;
    Serial.println("BNO085: rumbo I2C recibido");
    return;
  }

  const float delta = normalizeHeadingDelta(
      yawDegrees - previousYawDegrees
  );
  previousYawDegrees = yawDegrees;

  if (missionComplete || !roundTimerStarted) {
    return;
  }

  if (!lapTrackingActive) {
    lapTrackingActive = true;
    accumulatedTurnDegrees = 0.0f;
    completedLaps = 0;
    Serial.println("Conteo de vueltas de obstaculos iniciado");
    return;
  }

  // isfinite() atrapa el NaN: sin este filtro un solo cuadro malo dejaria el
  // giro acumulado en NaN para siempre y con el el tramo y toda la ayuda.
  if (!isfinite(delta) || fabsf(delta) > MAX_HEADING_STEP_DEGREES) {
    Serial.println("BNO085: salto de rumbo descartado");
    return;
  }

  accumulatedTurnDegrees += delta;

  const uint8_t newLapCount = static_cast<uint8_t>(
      floorf(fabsf(accumulatedTurnDegrees) / DEGREES_PER_LAP)
  );

  if (newLapCount > completedLaps) {
    completedLaps = min(newLapCount, TARGET_LAPS);
    Serial.print("Vuelta de obstaculos: ");
    Serial.print(completedLaps);
    Serial.print("/");
    Serial.println(TARGET_LAPS);
  }

  if (fabsf(accumulatedTurnDegrees) >=
      DEGREES_PER_LAP * TARGET_LAPS) {
    finishMission();
  }
}

void updateBno085(unsigned long nowMs) {
  if (!bno085Initialized) {
    const unsigned long retryIntervalMs = roundTimerStarted
        ? BNO085_RETRY_RUNNING_MS
        : BNO085_RETRY_STOPPED_MS;

    if (nowMs - lastBno085RetryMs >= retryIntervalMs) {
      lastBno085RetryMs = nowMs;
      Serial.println("BNO085: reintentando iniciar por I2C");
      beginBno085I2c();
    }
    return;
  }

  // Responde en I2C pero no manda cuaterniones: reiniciarlo es la unica
  // salida, porque el conteo de vueltas depende por completo de el.
  if (lastBno085FrameMs != 0 &&
      nowMs - lastBno085FrameMs >= BNO085_STALL_TIMEOUT_MS) {
    Serial.println("BNO085: sin datos, se reinicia el sensor");
    bno085Initialized = false;
    bno085HasHeading = false;
    lastBno085RetryMs = nowMs;
    return;
  }

  if (bno085.wasReset()) {
    bno085HasHeading = false;
    if (!bno085.enableReport(
            SH2_GAME_ROTATION_VECTOR,
            BNO085_REPORT_INTERVAL_US
        )) {
      bno085Initialized = false;
      Serial.println("ERROR: reporte BNO085 no restaurado");
      return;
    }
  }

  while (bno085.getSensorEvent(&bno085SensorValue)) {
    if (bno085SensorValue.sensorId != SH2_GAME_ROTATION_VECTOR) {
      continue;
    }

    const float qr = bno085SensorValue.un.gameRotationVector.real;
    const float qi = bno085SensorValue.un.gameRotationVector.i;
    const float qj = bno085SensorValue.un.gameRotationVector.j;
    const float qk = bno085SensorValue.un.gameRotationVector.k;
    const float yawDegrees = atan2f(
        2.0f * (qi * qj + qk * qr),
        qi * qi - qj * qj - qk * qk + qr * qr
    ) * RAD_TO_DEG;
    processBno085Heading(yawDegrees, nowMs);
  }
}

void updateOdometry() {
  const uint32_t currentPulses = readEncoderPulseCount();

  if (!bno085HasHeading) {
    odometryLastPulseCount = currentPulses;
    return;
  }

  if (!odometryHasOrigin) {
    odometryHasOrigin = true;
    odometryHeadingOriginDegrees = currentYawDegrees;
    odometryLastPulseCount = currentPulses;
    return;
  }

  const uint32_t deltaPulses = currentPulses - odometryLastPulseCount;
  odometryLastPulseCount = currentPulses;

  if (deltaPulses == 0 ||
      odometryMotorDirection == ODOMETRY_DIRECTION_STOPPED) {
    return;
  }

  const float distanceMm =
      static_cast<float>(deltaPulses) *
      ENCODER_MM_PER_PULSE *
      static_cast<float>(odometryMotorDirection);
  const float relativeHeadingDegrees = normalizeHeadingDelta(
      currentYawDegrees - odometryHeadingOriginDegrees
  );
  const float headingRadians = relativeHeadingDegrees * DEG_TO_RAD;

  odometryXmm += distanceMm * cosf(headingRadians);
  odometryYmm += distanceMm * sinf(headingRadians);
  odometrySignedDistanceMm += distanceMm;
  odometryTravelDistanceMm += fabsf(distanceMm);
}

bool tryBeginBno085AtAddress(uint8_t address) {
  if (!bno085.begin_I2C(address, &Wire)) {
    return false;
  }
  if (!bno085.enableReport(
          SH2_GAME_ROTATION_VECTOR,
          BNO085_REPORT_INTERVAL_US
      )) {
    return false;
  }

  bno085Initialized = true;
  bno085I2cAddressDetected = address;
  lastBno085FrameMs = millis();
  Serial.print("BNO085 I2C listo en 0x");
  Serial.println(address, HEX);
  return true;
}

void beginBno085I2c() {
  if (tryBeginBno085AtAddress(BNO085_I2C_ADDRESS_PRIMARY) ||
      tryBeginBno085AtAddress(BNO085_I2C_ADDRESS_SECONDARY)) {
    return;
  }
  Serial.println("AVISO: BNO085 no detectado en 0x4B ni 0x4A");
}

// --------------------------- Dashboard WiFi ------------------------

const char DASHBOARD_HTML[] PROGMEM = R"rawliteral(
<!doctype html><html lang="es"><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>WRO Obstaculos V2</title><style>
:root{color-scheme:dark;--bg:#071018;--card:#10202b;--line:#29404e;
--text:#f1f7fa;--muted:#93a8b5;--cyan:#35d6ff;--green:#45e68a;
--orange:#ffb454;--red:#ff6474}*{box-sizing:border-box}body{margin:0;
background:radial-gradient(circle at top,#16364b,var(--bg) 48%);color:var(--text);
font:15px system-ui,sans-serif}.wrap{width:min(1050px,94vw);margin:auto;padding:24px 0}
header{display:flex;justify-content:space-between;align-items:center;gap:12px}
h1{margin:2px 0 18px;font-size:clamp(25px,5vw,38px)}.tag{color:var(--cyan);
font-size:12px;font-weight:800;letter-spacing:.12em}.status{padding:9px 13px;
border:1px solid var(--line);border-radius:999px}.ok{color:var(--green)}
.warn{color:var(--orange)}.stop{color:var(--red)}.grid{display:grid;
grid-template-columns:repeat(4,1fr);gap:12px}.card{background:linear-gradient(145deg,
#142733,#0c1821);border:1px solid var(--line);border-radius:16px;padding:16px}
.wide{grid-column:span 2}.full{grid-column:1/-1}.label{color:var(--muted);
font-size:12px;text-transform:uppercase;letter-spacing:.08em}.value{font-size:
clamp(25px,5vw,40px);font-weight:800;margin-top:4px}.unit{font-size:14px;
color:var(--muted)}.cyan{color:var(--cyan)}.sensors,.details{display:grid;
grid-template-columns:repeat(5,1fr);gap:8px;margin-top:12px}.box{background:#09141c;
border-radius:10px;padding:11px;text-align:center}.box b{display:block;margin-top:4px;
font-size:18px}#openmv .details{grid-template-columns:repeat(3,1fr)}
footer{text-align:center;
color:var(--muted);font-size:12px;margin-top:18px}
@media(max-width:700px){.grid{grid-template-columns:repeat(2,1fr)}.wide{grid-column:
span 2}.details{grid-template-columns:repeat(2,1fr)}header{align-items:flex-start;
flex-direction:column}.status{margin-bottom:12px}}
</style></head><body><main class="wrap"><header><div><div class="tag">WRO INDIA 2026</div>
<h1>Obst&aacute;culos V2</h1></div><div id="status" class="status">Conectando...</div></header>
<section class="grid"><article class="card"><div class="label">Vueltas</div>
<div class="value cyan"><span id="laps">0</span><span class="unit"> / 3</span></div></article>
<article class="card"><div class="label">Tiempo de ronda</div><div id="time" class="value">0:00.0</div></article>
<article class="card"><div class="label">Rumbo</div><div class="value"><span id="yaw">--</span><span class="unit">&deg;</span></div></article>
<article class="card"><div class="label">Motor</div><div class="value"><span id="speed">0</span><span class="unit">%</span></div></article>
<article class="card full"><div class="label">Posici&oacute;n estimada desde la salida</div>
<div class="details"><div class="box">X<b><span id="odoX">0.0</span> cm</b></div>
<div class="box">Y<b><span id="odoY">0.0</span> cm</b></div>
<div class="box">Recorrido<b><span id="odoTravel">0.0</span> cm</b></div>
<div class="box">Odometr&iacute;a<b id="odoState">--</b></div></div></article>
<article class="card full"><div class="label">Ultras&oacute;nicos</div><div id="sensors" class="sensors"></div></article>
<article class="card wide" id="openmv"><div class="label">OpenMV</div><div class="details">
<div class="box">Color<b id="color">--</b></div><div class="box">ROI<b id="roi">--</b></div>
<div class="box">X<b id="x">--</b></div><div class="box">Y<b id="y">--</b></div>
<div class="box">Pared<b id="wall">--</b></div><div class="box">Enlace<b id="link">--</b></div>
<div class="box">Estac.<b id="park">--</b></div>
<div class="box">Maniobra<b id="parkPhase">--</b></div></div></article>
<article class="card wide"><div class="label">Diagn&oacute;stico</div><div class="details">
<div class="box">Manda<b id="ctrl">--</b></div>
<div class="box">Sensores<b id="sens">--</b></div>
<div class="box">Motor<b><span id="mtr">--</span></b></div></div></article>
<article class="card wide"><div class="label">Control</div><div class="details">
<div class="box">Servo<b><span id="servo">--</span>&deg;</b></div>
<div class="box">Objetivo<b><span id="target">--</span>%</b></div>
<div class="box">Encoder<b id="encoder">--</b></div><div class="box">BNO I2C<b id="bno">--</b></div></div></article>
</section><footer>Telemetr&iacute;a local de pruebas &middot; 192.168.4.1</footer></main>
<script>const put=(id,v)=>document.getElementById(id).textContent=v;
const ss=document.getElementById('sensors');ss.innerHTML=[1,2,3,4,5].map(n=>
`<div class="box">S${n}<b id="s${n}">--</b></div>`).join('');
function clock(ms){const s=ms/1000,m=Math.floor(s/60);return m+':'+String(
Math.floor(s%60)).padStart(2,'0')+'.'+Math.floor(ms%1000/100)}
async function refresh(){try{const d=await(await fetch('/api/status',{cache:'no-store'})).json();
put('laps',d.laps);put('time',clock(d.elapsedMs));put('yaw',d.yaw.toFixed(1));
put('speed',d.speed);put('target',d.target);put('servo',d.servo);put('encoder',d.encoder);
put('odoX',(d.odoX/10).toFixed(1));put('odoY',(d.odoY/10).toFixed(1));
put('odoTravel',(d.odoTravel/10).toFixed(1));put('odoState',d.odoReady?'ACTIVA':'SIN BNO');
put('bno',d.bno?('0x'+d.bno.toString(16).toUpperCase()):'--');put('color',d.color);
put('roi',d.roi);put('x',d.x);put('y',d.y);
put('wall',d.wall?'NEGRA':'--');
put('link',(d.camAgeMs>500?'SIN DATOS':'OK')+' / '+d.camBad+' desc.');
put('park',d.park?('X '+d.parkX):'--');
put('parkPhase',d.parkPhase+' ('+d.parkWalls+')'+(d.parkWhy?' - '+d.parkWhy:''));
put('ctrl',d.ctrl);
put('sens',d.sensAge>400?('MUDO '+d.sensAge+'ms'):('OK '+d.sensAge+'ms'));
put('mtr',d.speed+'% de '+d.target+'%');d.distances.forEach((v,i)=>put('s'+(i+1),(v/10).toFixed(1)+' cm'));
const st=document.getElementById('status');st.textContent=d.state;st.className='status '+d.level;
}catch(e){const st=document.getElementById('status');st.textContent='Sin conexion';st.className='status stop'}}
refresh();setInterval(refresh,250);</script></body></html>
)rawliteral";

// Que rama del loop tiene el mando ahora mismo, en el mismo orden de
// prioridad que usa loop(). Es distinto del estado general: durante el
// estacionamiento el robot sigue rodando con el PID de pasillo, y eso el
// estado no lo dejaba ver.
const char *controlBranchText() {
  if (wallEscapeActive()) return "ESCAPE_PARED";
  if (collisionRecoveryActive()) return "COLISION";
  if (parkingActive() && !parkingIsMovingForward()) return "MANIOBRA";
  if (pillarHasSteeringControl) return "PILAR";
  return "PASILLO";
}

const char *dashboardStateText() {
  if (missionComplete) return "3 vueltas completadas";
  if (distanceSensorFailsafeActive) return "Sin sensores I2C";
  if (parkingActive()) return parkingStateText();
  if (sideWallGuardActive) return "Limitado por pared lateral";
  if (wallEscapeActive()) return "Escape de pared";
  if (collisionRecoveryActive()) return "Recuperacion de colision";
  if (pillarHasSteeringControl && lockedPillarSeenBySideSensors) {
    return "Rodeando pilar enclavado";
  }
  if (pillarHasSteeringControl) return "Control por pilar";
  if (corridorReturnActive) return "Retorno gradual al pasillo";
  if (!bno085Initialized) return "Pasillo; BNO085 no detectado";
  if (!bno085HasHeading) return "SIN GIROSCOPIO: no se cuentan vueltas";
  return "Control de pasillo";
}

const char *dashboardStateLevel() {
  if (missionComplete || distanceSensorFailsafeActive) return "stop";
  if (wallEscapeActive() || collisionRecoveryActive() ||
      !bno085HasHeading ||
      communicationTimedOut) return "warn";
  return "ok";
}

const char *dashboardColorText() {
  if (openMVData.detectedId == 3) return "Verde";
  if (openMVData.detectedId == 5) return "Rojo";
  return "Ninguno";
}

