RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
void sendDashboardStatus() {
  char json[1600];
  unsigned long pillarHoldRemainingMs = 0;
  if (pillarLockActive && pillarSideClearSinceMs != 0) {
    const unsigned long heldMs = millis() - pillarSideClearSinceMs;
    if (heldMs < PILLAR_POST_CLEAR_HOLD_MS) {
      pillarHoldRemainingMs = PILLAR_POST_CLEAR_HOLD_MS - heldMs;
    }
  }
  snprintf(
      json,
      sizeof(json),
      "{\"laps\":%u,\"elapsedMs\":%lu,\"yaw\":%.2f,\"speed\":%u,"
      "\"target\":%u,\"servo\":%d,\"encoder\":%lu,\"bno\":%u,"
      "\"odoX\":%.1f,\"odoY\":%.1f,\"odoSigned\":%.1f,"
      "\"odoTravel\":%.1f,\"odoReady\":%u,"
      "\"color\":\"%s\",\"detectedId\":%d,\"roi\":%d,\"x\":%d,\"y\":%d,"
      "\"wall\":%d,\"camAgeMs\":%lu,\"camBad\":%lu,"
      "\"sideGuard\":%u,\"sideMm\":%u,"
      "\"park\":%d,\"parkX\":%d,\"parkArea\":%d,"
      "\"parkPhase\":\"%s\",\"parkWalls\":%u,\"parkSide\":%d,"
      "\"parkWhy\":\"%s\","
      "\"ctrl\":\"%s\",\"sensAge\":%lu,"
      "\"pillarLock\":%u,\"pillarControl\":%u,\"returning\":%u,"
      "\"lockedId\":%d,\"sideCleared\":%u,\"holdMs\":%lu,"
      "\"distances\":[%u,%u,%u,%u,%u],\"state\":\"%s\",\"level\":\"%s\"}",
      completedLaps,
      roundElapsedMs(),
      currentYawDegrees,
      appliedMotorSpeedPercent,
      targetMotorSpeedPercent,
      lastWrittenServoAngle,
      static_cast<unsigned long>(readEncoderPulseCount()),
      bno085I2cAddressDetected,
      odometryXmm,
      odometryYmm,
      odometrySignedDistanceMm,
      odometryTravelDistanceMm,
      odometryHasOrigin && bno085HasHeading ? 1U : 0U,
      dashboardColorText(),
      openMVData.detectedId,
      openMVData.roiCode,
      openMVData.xReference,
      openMVData.yReference,
      openMVData.wallBlack,
      openMVData.receivedAtMs == 0
          ? 999999UL
          : millis() - openMVData.receivedAtMs,
      totalInvalidFrames,
      sideWallGuardActive ? 1U : 0U,
      sideWallGuardDistanceMm,
      openMVData.parkingDetected,
      openMVData.parkingX,
      openMVData.parkingArea,
      parkingStateText(),
      parkingWallsPassed,
      parkingSide,
      parkingFinishReason,
      controlBranchText(),
      lastValidSensorMs == 0
          ? 999999UL
          : millis() - lastValidSensorMs,
      pillarLockActive ? 1U : 0U,
      pillarHasSteeringControl ? 1U : 0U,
      corridorReturnActive ? 1U : 0U,
      lockedPillarId,
      lockedPillarSeenBySideSensors ? 1U : 0U,
      pillarHoldRemainingMs,
      latestDistancesMm[0], latestDistancesMm[1], latestDistancesMm[2],
      latestDistancesMm[3], latestDistancesMm[4],
      dashboardStateText(), dashboardStateLevel()
  );
  dashboardServer.send(200, "application/json", json);
}

void beginDashboard() {
  if (!DASHBOARD_ENABLED) {
    WiFi.mode(WIFI_OFF);
    return;
  }
  WiFi.mode(WIFI_AP);
  WiFi.softAP(DASHBOARD_WIFI_NAME, DASHBOARD_WIFI_PASSWORD);
  dashboardServer.on("/", []() {
    dashboardServer.send_P(200, "text/html; charset=utf-8", DASHBOARD_HTML);
  });
  dashboardServer.on("/api/status", sendDashboardStatus);
  dashboardServer.begin();
  Serial.print("Dashboard: ");
  Serial.print(DASHBOARD_WIFI_NAME);
  Serial.print(" -> http://");
  Serial.println(WiFi.softAPIP());
}

void updateDashboard() {
  if (DASHBOARD_ENABLED) dashboardServer.handleClient();
}

// -------------------------- Utilidades UART -------------------------

bool isDetectedIdValid(long value) {
  return value == 0 || value == 3 || value == 5;
}

bool isRoiCodeValid(long value) {
  return value >= 0 && value <= 2;
}

bool isCollisionIdValid(long value) {
  return value == 0 || value == 3 || value == 5;
}

long clampLong(long value, long minimum, long maximum) {
  if (value < minimum) {
    return minimum;
  }
  if (value > maximum) {
    return maximum;
  }
  return value;
}

// Deja la X en el rango -100..100 que espera todo el control, venga
// normalizada de la camara o en pixeles.
long normalizeOpenMVx(long xReference) {
  if (OPENMV_X_IS_NORMALIZED) {
    return xReference;
  }

  const long pixels =
      clampLong(xReference, 0, OPENMV_IMAGE_WIDTH_PX - 1);

  return (pixels * 200L + (OPENMV_IMAGE_WIDTH_PX - 1) / 2L) /
             (OPENMV_IMAGE_WIDTH_PX - 1L) -
         100L;
}

// Divide la linea en enteros separados por comas. Tolera espacios y una coma
// final. Devuelve cuantos campos venian en la linea, o -1 si aparece algo que
// no pertenece a una trama numerica: texto de arranque de la camara, ruido de
// la linea o media trama tras un reinicio.
int splitOpenMVFields(const char *line, long *fields, int maxFields) {
  int count = 0;
  const char *cursor = line;

  while (*cursor != '\0') {
    while (*cursor == ' ' || *cursor == '\t' ||
           *cursor == '\r' || *cursor == '\n') {
      ++cursor;
    }
    if (*cursor == '\0') {
      break;
    }

    bool negative = false;
    if (*cursor == '+' || *cursor == '-') {
      negative = (*cursor == '-');
      ++cursor;
    }

    if (*cursor < '0' || *cursor > '9') {
      return -1;
    }

    long value = 0;
    uint8_t digits = 0;
    while (*cursor >= '0' && *cursor <= '9') {
      if (digits < 9) {
        // Nueve digitos caben siempre en un long de 32 bits.
        value = value * 10L + static_cast<long>(*cursor - '0');
      }
      ++digits;
      ++cursor;
    }

    if (digits > 9) {
      return -1;
    }

    if (negative) {
      value = -value;
    }

    if (count < maxFields) {
      fields[count] = value;
    }
    ++count;

    while (*cursor == ' ' || *cursor == '\t' ||
           *cursor == '\r' || *cursor == '\n') {
      ++cursor;
    }

    if (*cursor == ',') {
      ++cursor;
      continue;
    }
    if (*cursor == '\0') {
      break;
    }

    return -1;
  }

  return count;
}

// Corrige los campos en lugar de tirar la trama entera. Solo se rechaza lo
// estructuralmente imposible; un valor de mas o de menos no debe apagar el
// control por camara durante toda la vuelta.
bool sanitizeOpenMVFields(long *fields, int fieldCount) {
  if (!isDetectedIdValid(fields[0]) ||
      !isRoiCodeValid(fields[4]) ||
      !isCollisionIdValid(fields[5])) {
    return false;
  }

