RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  if (fieldCount < 7) {
    // Firmware anterior: no manda el estado de la pared negra.
    fields[6] = 0;
  }
  fields[6] = (fields[6] != 0) ? 1 : 0;

  if (fieldCount < 10) {
    // Firmware sin estacionamiento.
    fields[7] = 0;
    fields[8] = 0;
    fields[9] = 0;
  }

  fields[7] = (fields[7] != 0) ? 1 : 0;

  // Una X de pared fuera de rango es campo corrupto, no redondeo: se descarta
  // solo el estacionamiento y se conserva el resto de la trama, que puede
  // llevar el pilar con el que se esta dirigiendo ahora mismo.
  if (fields[7] != 0 &&
      (fields[8] < OPENMV_X_MIN - OPENMV_X_TOLERANCE ||
       fields[8] > OPENMV_X_MAX + OPENMV_X_TOLERANCE ||
       fields[9] <= 0)) {
    fields[7] = 0;
  }

  if (fields[7] == 0) {
    fields[8] = 0;
    fields[9] = 0;
  } else {
    fields[8] = clampLong(fields[8], OPENMV_X_MIN, OPENMV_X_MAX);
    fields[9] = clampLong(fields[9], 0, INT16_MAX);
  }

  if (fields[0] == 0) {
    // Sin deteccion se normaliza a la trama vacia canonica.
    fields[1] = -1;
    fields[2] = -1;
    fields[3] = 0;
    fields[4] = 0;
    fields[5] = 0;
    return true;
  }

  // Con pilar, la ROI y el area son obligatorias: sin ellas no hay objetivo
  // al que apuntar el servo.
  if (fields[4] != 1 && fields[4] != 2) {
    return false;
  }
  if (fields[3] <= 0) {
    return false;
  }

  fields[1] = normalizeOpenMVx(fields[1]);

  // Fuera de la tolerancia no es redondeo: suele ser trama corrupta o
  // OPENMV_X_IS_NORMALIZED mal configurado respecto al script de la camara.
  if (fields[1] < OPENMV_X_MIN - OPENMV_X_TOLERANCE ||
      fields[1] > OPENMV_X_MAX + OPENMV_X_TOLERANCE) {
    return false;
  }

  fields[1] = clampLong(fields[1], OPENMV_X_MIN, OPENMV_X_MAX);
  fields[2] = clampLong(fields[2], 0, OPENMV_IMAGE_HEIGHT_PX - 1);
  fields[3] = clampLong(fields[3], 0, INT16_MAX);

  // OpenMV solo declara colision para el mismo pilar dentro de ROI_LOW. Una
  // combinacion imposible se ignora bajando la colision a cero: se conserva la
  // direccion de la trama y no se dispara una maniobra falsa.
  if (fields[5] != 0 &&
      (fields[5] != fields[0] || fields[4] != 2)) {
    fields[5] = 0;
  }

  return true;
}

bool parseOpenMVLine(const char *line, OpenMVData &result) {
  long fields[OPENMV_MAX_FIELDS];
  for (int i = 0; i < OPENMV_MAX_FIELDS; ++i) {
    fields[i] = 0;
  }

  const int fieldsRead =
      splitOpenMVFields(line, fields, OPENMV_MAX_FIELDS);

  // Se aceptan 6 campos o mas. Los que sobran quedan fuera del arreglo y se
  // descartan sin invalidar la linea.
  if (fieldsRead < OPENMV_MIN_FIELDS) {
    return false;
  }

  const int usableFields =
      (fieldsRead < OPENMV_MAX_FIELDS) ? fieldsRead : OPENMV_MAX_FIELDS;

  if (!sanitizeOpenMVFields(fields, usableFields)) {
    return false;
  }

  result.detectedId = static_cast<int16_t>(fields[0]);
  result.xReference = static_cast<int16_t>(fields[1]);
  result.yReference = static_cast<int16_t>(fields[2]);
  result.areaPixels = static_cast<int16_t>(fields[3]);
  result.roiCode = static_cast<int16_t>(fields[4]);
  result.collisionId = static_cast<int16_t>(fields[5]);
  result.wallBlack = static_cast<int16_t>(fields[6]);
  result.parkingDetected = static_cast<int16_t>(fields[7]);
  result.parkingX = static_cast<int16_t>(fields[8]);
  result.parkingArea = static_cast<int16_t>(fields[9]);
  result.receivedAtMs = millis();
  return true;
}

bool hasValidPillarTarget(const OpenMVData &data) {
  return (data.detectedId == 3 || data.detectedId == 5) &&
         data.xReference >= OPENMV_X_MIN &&
         data.xReference <= OPENMV_X_MAX &&
         (data.roiCode == 1 || data.roiCode == 2);
}

// ------------------------- Control del servo ------------------------

bool beginServoPwm() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(
      SERVO_PIN,
      SERVO_PWM_FREQUENCY_HZ,
      SERVO_PWM_RESOLUTION_BITS
  );
#else
  ledcSetup(
      SERVO_PWM_CHANNEL,
      SERVO_PWM_FREQUENCY_HZ,
      SERVO_PWM_RESOLUTION_BITS
  );
  ledcAttachPin(SERVO_PIN, SERVO_PWM_CHANNEL);
  return true;
#endif
}

void writeServoHardware(int angleDegrees) {
  if (!servoReady) {
    return;
  }

  angleDegrees = constrain(angleDegrees, 0, 180);

  const uint32_t pulseUs =
      SERVO_MIN_PULSE_US +
      (static_cast<uint32_t>(angleDegrees) *
       (SERVO_MAX_PULSE_US - SERVO_MIN_PULSE_US)) /
          180UL;

  constexpr uint32_t PWM_PERIOD_US =
      1000000UL / SERVO_PWM_FREQUENCY_HZ;
  constexpr uint32_t PWM_MAX_DUTY =
      (1UL << SERVO_PWM_RESOLUTION_BITS) - 1UL;

  const uint32_t duty =
      (pulseUs * PWM_MAX_DUTY + PWM_PERIOD_US / 2UL) /
      PWM_PERIOD_US;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(SERVO_PIN, duty);
#else
  ledcWrite(SERVO_PWM_CHANNEL, duty);
#endif
}

int commandServoAngle(float angleDegrees) {
  angleDegrees = constrain(
      angleDegrees,
      static_cast<float>(SERVO_CENTER_DEGREES -
                         SERVO_MAX_CORRECTION_DEGREES),
      static_cast<float>(SERVO_CENTER_DEGREES +
                         SERVO_MAX_CORRECTION_DEGREES)
  );

  currentServoAngleDegrees = angleDegrees;
  const int roundedAngle = static_cast<int>(roundf(angleDegrees));

  if (roundedAngle != lastWrittenServoAngle) {
    writeServoHardware(roundedAngle);
    lastWrittenServoAngle = roundedAngle;
  }

  return roundedAngle;
}

void resetCorridorPid() {
  pidIntegralError = 0.0f;
  pidPreviousError = 0.0f;
  pidFilteredDerivative = 0.0f;
  pidPreviousUpdateUs = 0;
  pidHasPreviousSample = false;
}

void takePillarSteeringControl() {
  if (!pillarHasSteeringControl) {
    resetCorridorPid();
  }

  pillarHasSteeringControl = true;
  corridorReturnActive = false;
}

void releasePillarSteeringControl() {
  if (!pillarHasSteeringControl) {
    return;
  }

  pillarHasSteeringControl = false;
  corridorReturnActive = true;
  corridorReturnStartMs = millis();
  lastCorridorBlendStepMs = corridorReturnStartMs;
  resetCorridorPid();
}

void resetFrontGuard() {
  frontGuardActive = false;
  frontGuardNearSamples = 0;
  frontGuardClearSamples = 0;
}

void updateFrontGuard(uint16_t frontDistanceMm) {
  if (!pillarLockActive) {
    resetFrontGuard();
    return;
  }

