RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  if (frontDistanceMm == INVALID_DISTANCE_MM) {
    return;
  }

  if (!frontGuardActive) {
    frontGuardNearSamples = frontDistanceMm <= FRONT_GUARD_ACTIVATE_MM
        ? static_cast<uint8_t>(frontGuardNearSamples + 1)
        : 0;

    if (frontGuardNearSamples >= FRONT_GUARD_CONFIRM_SAMPLES) {
      frontGuardActive = true;
      frontGuardNearSamples = 0;
      frontGuardClearSamples = 0;
      Serial.println(
          "PROTECCION FRONTAL: S3 <= 40 cm, refuerzo de evasion"
      );
    }
    return;
  }

  frontGuardClearSamples = frontDistanceMm >= FRONT_GUARD_RELEASE_MM
      ? static_cast<uint8_t>(frontGuardClearSamples + 1)
      : 0;

  if (frontGuardClearSamples >= FRONT_GUARD_CONFIRM_SAMPLES) {
    resetFrontGuard();
    Serial.println("PROTECCION FRONTAL: S3 libre, control normal");
  }
}

void beginPillarLock(const OpenMVData &data) {
  pillarLockActive = true;
  lockedPillarId = data.detectedId;
  lockedPillarData = data;
  lockedPillarReachedLowRoi = data.roiCode == 2;
  lockedPillarSeenBySideSensors = false;
  pillarWrapStartMs = 0;
  pillarSwitchFrames = 0;
  pillarSideDetectSamples = 0;
  pillarSideClearSamples = 0;
  pillarSideClearSinceMs = 0;
  lastLockedPillarSeenMs = data.receivedAtMs;
  resetFrontGuard();
  takePillarSteeringControl();

  Serial.print("Pilar enclavado: ");
  Serial.println(lockedPillarId == 3 ? "VERDE" : "ROJO");
}

void clearPillarLock(const char *reason) {
  if (!pillarLockActive) {
    return;
  }

  releasePillarSteeringControl();
  pillarLockActive = false;
  lockedPillarId = 0;
  lockedPillarData = {0, -1, -1, 0, 0, 0, 0, 0, 0, 0, 0};
  lockedPillarReachedLowRoi = false;
  lockedPillarSeenBySideSensors = false;
  pillarWrapStartMs = 0;
  pillarSwitchFrames = 0;
  pillarSideDetectSamples = 0;
  pillarSideClearSamples = 0;
  pillarSideClearSinceMs = 0;
  lastLockedPillarSeenMs = 0;
  resetFrontGuard();

  Serial.print("Pilar liberado: ");
  Serial.println(reason);
}

bool validDistanceAtMost(uint16_t distanceMm, uint16_t limitMm) {
  return distanceMm != INVALID_DISTANCE_MM && distanceMm <= limitMm;
}

bool distanceIsClear(uint16_t distanceMm, uint16_t limitMm) {
  return distanceMm == INVALID_DISTANCE_MM || distanceMm >= limitMm;
}

void getLockedPillarSideDistances(
    const uint16_t distancesMm[SENSOR_COUNT],
    uint16_t &firstDistanceMm,
    uint16_t &secondDistanceMm
) {
  if (lockedPillarId == 3) {
    // Pilar verde a la derecha del robot.
    firstDistanceMm = distancesMm[3];  // S4
    secondDistanceMm = distancesMm[4]; // S5
  } else {
    // Pilar rojo a la izquierda del robot.
    firstDistanceMm = distancesMm[0];  // S1
    secondDistanceMm = distancesMm[1]; // S2
  }
}

void updatePillarDistanceHandoff(
    const uint16_t distancesMm[SENSOR_COUNT],
    unsigned long nowMs
) {
  if (!pillarLockActive) {
    return;
  }

  const unsigned long timeSinceLastVisionMs =
      nowMs - lastLockedPillarSeenMs;
  const unsigned long handoffTimeoutMs = frontGuardActive
      ? FRONT_GUARD_HANDOFF_TIMEOUT_MS
      : PILLAR_SENSOR_HANDOFF_TIMEOUT_MS;
  const unsigned long lockReleaseTimeoutMs = frontGuardActive
      ? FRONT_GUARD_LOCK_RELEASE_TIMEOUT_MS
      : PILLAR_LOCK_RELEASE_TIMEOUT_MS;

  if (!lockedPillarReachedLowRoi) {
    if (timeSinceLastVisionMs >= PILLAR_HIGH_LOSS_TIMEOUT_MS) {
      clearPillarLock("perdido antes de ROI_LOW");
    }
    return;
  }

  uint16_t firstDistanceMm;
  uint16_t secondDistanceMm;
  getLockedPillarSideDistances(
      distancesMm,
      firstDistanceMm,
      secondDistanceMm
  );

  const bool pillarIsNear =
      validDistanceAtMost(firstDistanceMm, PILLAR_SIDE_DETECT_MM) ||
      validDistanceAtMost(secondDistanceMm, PILLAR_SIDE_DETECT_MM);

  const bool pillarSideIsClear =
      distanceIsClear(firstDistanceMm, PILLAR_SIDE_CLEAR_MM) &&
      distanceIsClear(secondDistanceMm, PILLAR_SIDE_CLEAR_MM);

  if (!lockedPillarSeenBySideSensors) {
    pillarSideDetectSamples = pillarIsNear
        ? static_cast<uint8_t>(pillarSideDetectSamples + 1)
        : 0;

    if (pillarSideDetectSamples >= PILLAR_SIDE_CONFIRM_SAMPLES) {
      lockedPillarSeenBySideSensors = true;
      pillarWrapStartMs = nowMs;
      pillarSideDetectSamples = 0;
      pillarSideClearSamples = 0;
      pillarSideClearSinceMs = 0;
      Serial.println(
          "Pilar confirmado por ultrasonicos: inicia rodeo lateral"
      );
      return;
    }

    if (pillarHasSteeringControl &&
        timeSinceLastVisionMs >= handoffTimeoutMs) {
      releasePillarSteeringControl();
      Serial.println(
          "Handoff de seguridad: ultrasonicos sin confirmar el pilar"
      );
    }

    if (timeSinceLastVisionMs >= lockReleaseTimeoutMs) {
      clearPillarLock("timeout de sensores laterales");
    }
    return;
  }

  if (pillarSideIsClear) {
    if (pillarSideClearSinceMs == 0) {
      pillarSideClearSinceMs = nowMs;
    }
    if (pillarSideClearSamples < UINT8_MAX) {
      ++pillarSideClearSamples;
    }
  } else {
    pillarSideClearSamples = 0;
    pillarSideClearSinceMs = 0;
  }

  if (pillarSideClearSamples >= PILLAR_SIDE_CONFIRM_SAMPLES &&
      pillarSideClearSinceMs != 0 &&
      nowMs - pillarSideClearSinceMs >= PILLAR_POST_CLEAR_HOLD_MS) {
    clearPillarLock("ultrasonicos confirman costado libre");
    return;
  }

  // Tope del rodeo. Si el costado no se despeja es que ahi hay una pared,
  // no el pilar: seguir girando solo lleva a chocar contra ella.
  //
  // Con la pared de frente se concede mas tiempo, porque ahi el pilar esta
  // pegado a esa pared y la vuelta que hay que darle es mas larga.
  // Aqui el rodeo ya arranco, asi que el sello siempre es valido.
  const unsigned long wrapMaxMs = frontGuardActive
      ? FRONT_GUARD_WRAP_MAX_MS
      : PILLAR_WRAP_MAX_MS;

  if (nowMs - pillarWrapStartMs >= wrapMaxMs) {
    clearPillarLock(
        frontGuardActive
            ? "tope de rodeo largo: ni con pared de frente se despejo"
            : "tope de rodeo: el costado no se despeja"
    );
  }
}

int mapVisionErrorToCorrection(int visionError, int gainPercent) {
  visionError = constrain(visionError, OPENMV_X_MIN, OPENMV_X_MAX);

