RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  const long baseCorrectionDegrees = map(
      static_cast<long>(visionError),
      OPENMV_X_MIN,
      OPENMV_X_MAX,
      -SERVO_MAX_CORRECTION_DEGREES,
      SERVO_MAX_CORRECTION_DEGREES
  );

  const long amplifiedCorrection = baseCorrectionDegrees * gainPercent;

  return constrain(
      static_cast<int>(
          amplifiedCorrection >= 0
              ? (amplifiedCorrection + 50) / 100
              : (amplifiedCorrection - 50) / 100
      ),
      -SERVO_MAX_CORRECTION_DEGREES,
      SERVO_MAX_CORRECTION_DEGREES
  );
}

int lowRoiConeHalfWidth(int yReference) {
  const int constrainedY = constrain(
      yReference,
      LOW_ROI_CONE_FAR_Y,
      LOW_ROI_CONE_NEAR_Y
  );

  return static_cast<int>(
      map(
          constrainedY,
          LOW_ROI_CONE_FAR_Y,
          LOW_ROI_CONE_NEAR_Y,
          LOW_ROI_CONE_FAR_HALF_WIDTH,
          LOW_ROI_CONE_NEAR_HALF_WIDTH
      )
  );
}

int lowRoiTargetX(const OpenMVData &data) {
  const int halfWidth = lowRoiConeHalfWidth(data.yReference);
  return data.detectedId == 3 ? halfWidth : -halfWidth;
}

int calculateLowRoiError(const OpenMVData &data) {
  return constrain(
      data.xReference - lowRoiTargetX(data),
      OPENMV_X_MIN,
      OPENMV_X_MAX
  );
}

int calculatePillarServoAngle(const OpenMVData &data) {
  int visionError = 0;
  int gainPercent = 100;

  if (data.roiCode == 1) {
    visionError = data.xReference;
    gainPercent = HIGH_ROI_STEERING_GAIN_PERCENT;
  } else if (data.roiCode == 2) {
    visionError = calculateLowRoiError(data);
    gainPercent = LOW_ROI_EVASION_GAIN_PERCENT;
  }

  const int correctionDegrees =
      mapVisionErrorToCorrection(visionError, gainPercent);

  return SERVO_CENTER_DEGREES +
         OPENMV_SERVO_DIRECTION * correctionDegrees;
}

int calculatePillarServoWithFrontGuard(const OpenMVData &data) {
  int angleDegrees = calculatePillarServoAngle(data);

  if (!frontGuardActive || !lockedPillarReachedLowRoi) {
    return limitSteeringBySideWall(angleDegrees);
  }

  // Verde se evade hacia el lado negativo del servo y rojo hacia el positivo.
  const int colorDirection = data.detectedId == 3 ? -1 : 1;
  angleDegrees +=
      OPENMV_SERVO_DIRECTION *
      colorDirection *
      frontGuardExtraSteeringDegrees();

  angleDegrees = constrain(
      angleDegrees,
      SERVO_CENTER_DEGREES - SERVO_MAX_CORRECTION_DEGREES,
      SERVO_CENTER_DEGREES + SERVO_MAX_CORRECTION_DEGREES
  );

  return limitSteeringBySideWall(angleDegrees);
}

// Distancia mas cercana del costado pedido. S1/S2 miran a la izquierda y
// S4/S5 a la derecha; se toma la menor de las dos lecturas validas.
uint16_t nearestSideDistanceMm(
    bool leftSide,
    const uint16_t distancesMm[SENSOR_COUNT]
) {
  const uint16_t first = leftSide ? distancesMm[0] : distancesMm[3];
  const uint16_t second = leftSide ? distancesMm[1] : distancesMm[4];

  if (first == INVALID_DISTANCE_MM) {
    return second;
  }
  if (second == INVALID_DISTANCE_MM) {
    return first;
  }

  return min(first, second);
}

// Recorta el giro que lleva al robot contra la pared de ese costado. El
// recorte es proporcional: a SIDE_WALL_FREE_MM no toca nada y a
// SIDE_WALL_BLOCK_MM centra el volante, sin escalones que den tirones.
int limitSteeringBySideWall(int angleDegrees) {
  sideWallGuardActive = false;
  sideWallGuardDistanceMm = INVALID_DISTANCE_MM;

  if (!PILLAR_SIDE_WALL_GUARD_ENABLED) {
    return angleDegrees;
  }

  // Sin lecturas frescas no se limita nada: un dato viejo cortaria el
  // rodeo por una pared que el robot ya dejo atras.
  if (latestFrontDistanceAtMs == 0 ||
      millis() - latestFrontDistanceAtMs > SENSOR_FAILSAFE_TIMEOUT_MS) {
    return angleDegrees;
  }

  const int offsetDegrees = angleDegrees - SERVO_CENTER_DEGREES;
  if (offsetDegrees == 0) {
    return angleDegrees;
  }

  // El signo lo define el PID de pasillo, que ya esta calibrado: con error
  // positivo hay mas espacio a la izquierda y gira hacia alla, asi que ese
  // es el signo de "izquierda". Si recalibras CORRIDOR_SERVO_DIRECTION,
  // este limitador lo sigue solo.
  const bool steeringLeft =
      (offsetDegrees * CORRIDOR_SERVO_DIRECTION) > 0;

  const uint16_t sideMm =
      nearestSideDistanceMm(steeringLeft, latestDistancesMm);

  if (sideMm == INVALID_DISTANCE_MM || sideMm >= SIDE_WALL_FREE_MM) {
    return angleDegrees;
  }

  sideWallGuardActive = true;
  sideWallGuardDistanceMm = sideMm;

  if (sideMm <= SIDE_WALL_BLOCK_MM) {
    return SERVO_CENTER_DEGREES;
  }

  const long spanMm =
      static_cast<long>(SIDE_WALL_FREE_MM) - SIDE_WALL_BLOCK_MM;
  const long allowedOffset =
      (static_cast<long>(offsetDegrees) *
       (static_cast<long>(sideMm) - SIDE_WALL_BLOCK_MM)) /
      spanMm;

  return SERVO_CENTER_DEGREES + static_cast<int>(allowedOffset);
}

// Grados extra de rodeo segun lo cerca que este la pared del frente. Solo
// actua con la proteccion frontal activa, que a su vez exige pilar enclavado.
int frontGuardExtraSteeringDegrees() {
  if (!frontGuardActive) {
    return 0;
  }

  if (latestFrontDistanceAtMs == 0 ||
      millis() - latestFrontDistanceAtMs > SENSOR_FAILSAFE_TIMEOUT_MS ||
      latestFrontDistanceMm == INVALID_DISTANCE_MM) {
    return FRONT_GUARD_EXTRA_STEERING_DEGREES;
  }

  if (latestFrontDistanceMm <= FRONT_GUARD_MAX_STEER_MM) {
    return FRONT_GUARD_MAX_EXTRA_STEERING_DEGREES;
  }

  if (latestFrontDistanceMm >= FRONT_GUARD_ACTIVATE_MM) {
    return FRONT_GUARD_EXTRA_STEERING_DEGREES;
  }

  const long spanMm =
      static_cast<long>(FRONT_GUARD_ACTIVATE_MM) - FRONT_GUARD_MAX_STEER_MM;
  const long closenessMm =
      static_cast<long>(FRONT_GUARD_ACTIVATE_MM) - latestFrontDistanceMm;
  const long spanDegrees =
      FRONT_GUARD_MAX_EXTRA_STEERING_DEGREES -
      FRONT_GUARD_EXTRA_STEERING_DEGREES;

  return FRONT_GUARD_EXTRA_STEERING_DEGREES +
         static_cast<int>((closenessMm * spanDegrees) / spanMm);
}

int calculatePillarWrapServoAngle() {
  // Verde queda a la derecha: rodear por la izquierda. Rojo queda a la
  // izquierda: rodear por la derecha.
  const int colorDirection = lockedPillarId == 3 ? -1 : 1;
  const int correctionDegrees =
      PILLAR_WRAP_CORRECTION_DEGREES +
      frontGuardExtraSteeringDegrees();
  const int angleDegrees = constrain(
      SERVO_CENTER_DEGREES +
          OPENMV_SERVO_DIRECTION *
          PILLAR_WRAP_DIRECTION *
          colorDirection *
          correctionDegrees,
      SERVO_CENTER_DEGREES - SERVO_MAX_CORRECTION_DEGREES,
      SERVO_CENTER_DEGREES + SERVO_MAX_CORRECTION_DEGREES
  );

  return limitSteeringBySideWall(angleDegrees);
}

// Corta la entrega gradual cuando esperar deja de ser seguro: con la pared
// de frente el robot esta entrando a la esquina y necesita el giro completo
// ahora, no dentro de medio segundo.
bool corridorReturnMustFinishNow(unsigned long nowMs) {
  if (nowMs - corridorReturnStartMs >= CORRIDOR_RETURN_MAX_MS) {
    return true;
  }

