RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  if (latestFrontDistanceAtMs == 0 ||
      nowMs - latestFrontDistanceAtMs > SENSOR_FAILSAFE_TIMEOUT_MS) {
    return false;
  }

  return validDistanceAtMost(
      latestFrontDistanceMm,
      CORRIDOR_RETURN_ABORT_FRONT_MM
  );
}

int applyCorridorServoTarget(int targetAngle) {
  if (corridorReturnActive && corridorReturnMustFinishNow(millis())) {
    corridorReturnActive = false;
    Serial.println(
        "PASILLO: entrega inmediata del volante (esquina o tiempo agotado)"
    );
  }

  targetAngle = constrain(
      targetAngle,
      SERVO_CENTER_DEGREES - SERVO_MAX_CORRECTION_DEGREES,
      SERVO_CENTER_DEGREES + SERVO_MAX_CORRECTION_DEGREES
  );

  if (!corridorReturnActive) {
    return commandServoAngle(static_cast<float>(targetAngle));
  }

  const unsigned long nowMs = millis();
  unsigned long elapsedMs = nowMs - lastCorridorBlendStepMs;
  lastCorridorBlendStepMs = nowMs;
  elapsedMs = min(elapsedMs, MAX_BLEND_STEP_INTERVAL_MS);

  const float maxStep =
      CORRIDOR_RETURN_RATE_DEGREES_PER_SECOND *
      static_cast<float>(elapsedMs) /
      1000.0f;
  const float difference =
      static_cast<float>(targetAngle) - currentServoAngleDegrees;

  if (fabsf(difference) <= maxStep) {
    corridorReturnActive = false;
    return commandServoAngle(static_cast<float>(targetAngle));
  }

  if (difference > 0.0f) {
    return commandServoAngle(currentServoAngleDegrees + maxStep);
  }

  return commandServoAngle(currentServoAngleDegrees - maxStep);
}

// ---------------------- Control del motor TB6612 --------------------

bool beginMotorPwm() {
  pinMode(MOTOR_AIN1_PIN, OUTPUT);
  pinMode(MOTOR_AIN2_PIN, OUTPUT);
  digitalWrite(MOTOR_AIN1_PIN, LOW);
  digitalWrite(MOTOR_AIN2_PIN, LOW);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(
      MOTOR_PWM_PIN,
      MOTOR_PWM_FREQUENCY_HZ,
      MOTOR_PWM_RESOLUTION_BITS
  );
#else
  ledcSetup(
      MOTOR_PWM_CHANNEL,
      MOTOR_PWM_FREQUENCY_HZ,
      MOTOR_PWM_RESOLUTION_BITS
  );
  ledcAttachPin(MOTOR_PWM_PIN, MOTOR_PWM_CHANNEL);
  return true;
#endif
}

void setMotorDirectionForward() {
  odometryMotorDirection = ODOMETRY_DIRECTION_FORWARD;
  digitalWrite(
      MOTOR_AIN1_PIN,
      INVERT_MOTOR_DIRECTION ? LOW : HIGH
  );
  digitalWrite(
      MOTOR_AIN2_PIN,
      INVERT_MOTOR_DIRECTION ? HIGH : LOW
  );
}

void setMotorDirectionReverse() {
  odometryMotorDirection = ODOMETRY_DIRECTION_REVERSE;
  digitalWrite(
      MOTOR_AIN1_PIN,
      INVERT_MOTOR_DIRECTION ? HIGH : LOW
  );
  digitalWrite(
      MOTOR_AIN2_PIN,
      INVERT_MOTOR_DIRECTION ? LOW : HIGH
  );
}

void writeMotorPwmPercent(uint8_t percent) {
  if (!motorReady) {
    return;
  }

  percent = constrain(percent, 0, 100);
  constexpr uint32_t MOTOR_PWM_MAX_DUTY =
      (1UL << MOTOR_PWM_RESOLUTION_BITS) - 1UL;
  const uint32_t duty =
      (static_cast<uint32_t>(percent) * MOTOR_PWM_MAX_DUTY + 50UL) /
      100UL;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(MOTOR_PWM_PIN, duty);
#else
  ledcWrite(MOTOR_PWM_CHANNEL, duty);
#endif
  appliedMotorSpeedPercent = percent;
}

void stopMotor() {
  writeMotorPwmPercent(0);
  digitalWrite(MOTOR_AIN1_PIN, LOW);
  digitalWrite(MOTOR_AIN2_PIN, LOW);
  targetMotorSpeedPercent = 0;
  appliedMotorSpeedPercent = 0;
  odometryMotorDirection = ODOMETRY_DIRECTION_STOPPED;
  resetMotorStartupDetection();
  resetCorridorPid();
}

void setMotorSpeedPercent(uint8_t percent) {
  targetMotorSpeedPercent = constrain(percent, 0, 100);

  if (targetMotorSpeedPercent == 0) {
    stopMotor();
    return;
  }

  setMotorDirectionForward();
}

void setMotorReverseSpeedPercent(uint8_t percent) {
  targetMotorSpeedPercent = constrain(percent, 0, 100);

  if (targetMotorSpeedPercent == 0) {
    stopMotor();
    return;
  }

  setMotorDirectionReverse();
  writeMotorPwmPercent(targetMotorSpeedPercent);
}

void serviceMotorSoftStart(unsigned long nowMs) {
  if (!motorReady || targetMotorSpeedPercent == 0 ||
      wallEscapeActive() || collisionRecoveryActive() ||
      missionComplete) {
    return;
  }

  setMotorDirectionForward();

  if (motorStartupState == MotorStartupState::WAITING_FOR_MOVEMENT) {
    // Nunca superar la velocidad solicitada por el control de esquina o
    // pilar. Antes, una orden segura de 30 % podia provocar 45 % durante la
    // deteccion del encoder y durante buena parte de la supuesta rampa suave.
    const uint8_t startupSpeedPercent = min(
        MOTOR_START_DETECTION_PERCENT,
        targetMotorSpeedPercent
    );
    writeMotorPwmPercent(startupSpeedPercent);
    const uint32_t currentPulses = readEncoderPulseCount();
    const uint32_t detectedPulses =
        currentPulses - encoderDetectionBaseline;

    if (detectedPulses > 0 && !encoderDetectionWindowActive) {
      encoderDetectionWindowActive = true;
      encoderDetectionWindowStartMs = nowMs;
    }

    if (encoderDetectionWindowActive &&
        detectedPulses >= ENCODER_START_PULSES) {
      motorStartupState = MotorStartupState::RAMPING;
      motorRampStartMs = nowMs;
      if (!roundTimerStarted) {
        roundTimerStarted = true;
        roundStartMs = nowMs;
        roundFinishMs = 0;
        Serial.println("Cronometro de obstaculos iniciado");
      }

      if (targetMotorSpeedPercent <= MOTOR_START_DETECTION_PERCENT) {
        motorStartupState = MotorStartupState::RUNNING;
        writeMotorPwmPercent(targetMotorSpeedPercent);
        Serial.println(
            "Encoder confirma movimiento: velocidad objetivo aplicada"
        );
      } else {
        Serial.println(
            "Encoder confirma movimiento: inicia rampa suave"
        );
      }
      return;
    }

    if (encoderDetectionWindowActive &&
        nowMs - encoderDetectionWindowStartMs >=
            ENCODER_DETECTION_WINDOW_MS) {
      encoderDetectionBaseline = currentPulses;
      encoderDetectionWindowActive = false;
    }
    return;
  }

  if (motorStartupState == MotorStartupState::RAMPING) {
    const unsigned long elapsedMs = nowMs - motorRampStartMs;
    if (elapsedMs >= MOTOR_SOFT_START_DURATION_MS) {
      motorStartupState = MotorStartupState::RUNNING;
      writeMotorPwmPercent(targetMotorSpeedPercent);
      Serial.println("Rampa suave de obstaculos terminada");
      return;
    }

    const int16_t speedRange =
        static_cast<int16_t>(targetMotorSpeedPercent) -
        static_cast<int16_t>(MOTOR_START_DETECTION_PERCENT);
    const int16_t rampSpeed =
        static_cast<int16_t>(MOTOR_START_DETECTION_PERCENT) +
        static_cast<int32_t>(speedRange) * elapsedMs /
            MOTOR_SOFT_START_DURATION_MS;
    // Si el control reduce su objetivo durante la rampa, obedecerlo de
    // inmediato en vez de mantener temporalmente un PWM mayor.
    writeMotorPwmPercent(
        min(
            static_cast<uint8_t>(rampSpeed),
            targetMotorSpeedPercent
        )
    );
    return;
  }

  writeMotorPwmPercent(targetMotorSpeedPercent);
}

bool collisionRecoveryActive() {
  return collisionRecoveryState != CollisionRecoveryState::IDLE;
}

bool wallEscapeActive() {
  return wallEscapeState != WallEscapeState::IDLE;
}

void startCollisionRecovery(int16_t colorId) {
  clearPillarLock("colision detectada por OpenMV");
  collisionRecoveryState = CollisionRecoveryState::STOPPING;
  collisionRecoveryStateStartMs = millis();
  collisionReverseStartPulses = 0;
  collisionTriggerFrames = 0;
  collisionClearFrames = 0;
  collisionRecoveryColorId = colorId;

  stopMotor();
  corridorReturnActive = false;
  commandServoAngle(static_cast<float>(SERVO_CENTER_DEGREES));

  Serial.print("COLISION ");
  Serial.print(colorId == 3 ? "VERDE" : "ROJA");
  Serial.println(": volante centrado, preparando reversa");
}

void serviceCollisionRecovery(unsigned long nowMs) {
  if (!collisionRecoveryActive()) {
    return;
  }

