RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  // La maniobra completa conserva el volante centrado.
  commandServoAngle(static_cast<float>(SERVO_CENTER_DEGREES));

  if (collisionRecoveryState == CollisionRecoveryState::STOPPING) {
    if (nowMs - collisionRecoveryStateStartMs >=
        COLLISION_STOP_BEFORE_REVERSE_MS) {
      collisionRecoveryState = CollisionRecoveryState::REVERSING;
      collisionRecoveryStateStartMs = nowMs;
      collisionReverseStartPulses = readEncoderPulseCount();
      setMotorReverseSpeedPercent(COLLISION_REVERSE_SPEED_PERCENT);
      Serial.print("COLISION: reversa de ");
      Serial.print(COLLISION_REVERSE_DISTANCE_MM);
      Serial.println(" mm iniciada");
    }
    return;
  }

  if (collisionRecoveryState == CollisionRecoveryState::REVERSING) {
    const uint32_t traveledPulses =
        readEncoderPulseCount() - collisionReverseStartPulses;
    const float traveledMm =
        static_cast<float>(traveledPulses) * ENCODER_MM_PER_PULSE;
    const bool targetDistanceReached =
        traveledMm >= static_cast<float>(COLLISION_REVERSE_DISTANCE_MM);
    const bool reverseTimedOut =
        nowMs - collisionRecoveryStateStartMs >= COLLISION_REVERSE_MAX_MS;

    if (targetDistanceReached || reverseTimedOut) {
      stopMotor();
      collisionRecoveryState = CollisionRecoveryState::WAITING_FOR_CLEAR;
      collisionRecoveryStateStartMs = nowMs;
      collisionClearFrames = 0;
      Serial.print("COLISION: reversa terminada a ");
      Serial.print(traveledMm, 1);
      Serial.print(" mm");
      if (reverseTimedOut && !targetDistanceReached) {
        Serial.print(" (timeout de encoder)");
      }
      Serial.println(", esperando ROI libre");
    }
    return;
  }

  // WAITING_FOR_CLEAR permanece detenido hasta recibir varias tramas libres.
  stopMotor();
}

bool handleCollisionPacket(const OpenMVData &data) {
  // S3 tiene prioridad. No se inicia ni se reanuda una maniobra de OpenMV
  // mientras el robot esta escapando fisicamente de una pared.
  if (wallEscapeActive()) {
    collisionTriggerFrames = 0;
    collisionClearFrames = 0;
    return true;
  }

  const bool collisionDetected =
      data.collisionId == 3 || data.collisionId == 5;

  const bool collisionMatchesLockedPillar =
      collisionDetected &&
      pillarLockActive &&
      lockedPillarReachedLowRoi &&
      data.collisionId == lockedPillarId;

  if (!collisionRecoveryActive()) {
    collisionTriggerFrames = collisionMatchesLockedPillar
        ? static_cast<uint8_t>(collisionTriggerFrames + 1)
        : 0;

    if (collisionTriggerFrames >= COLLISION_TRIGGER_CONFIRM_FRAMES) {
      startCollisionRecovery(data.collisionId);
      return true;
    }
    return false;
  }

  if (collisionRecoveryState != CollisionRecoveryState::WAITING_FOR_CLEAR) {
    return true;
  }

  collisionClearFrames = collisionDetected
      ? 0
      : static_cast<uint8_t>(collisionClearFrames + 1);

  if (collisionClearFrames < COLLISION_CLEAR_CONFIRM_FRAMES) {
    return true;
  }

  collisionRecoveryState = CollisionRecoveryState::IDLE;
  collisionRecoveryStateStartMs = 0;
  collisionReverseStartPulses = 0;
  collisionTriggerFrames = 0;
  collisionClearFrames = 0;
  collisionRecoveryColorId = 0;
  resetCorridorPid();
  Serial.println("COLISION despejada: nuevo intento habilitado");
  return false;
}

bool updateWallEscape(
    uint16_t frontDistanceMm,
    unsigned long nowMs
) {
  const bool validFrontDistance =
      frontDistanceMm != INVALID_DISTANCE_MM;

  if (!wallEscapeActive() && validFrontDistance &&
      frontDistanceMm <= WALL_ESCAPE_TRIGGER_MM) {
    // La pared tiene prioridad sobre el pilar y cualquier recuperacion por
    // color que estuviera en curso.
    clearPillarLock("escape frontal de pared");
    collisionRecoveryState = CollisionRecoveryState::IDLE;
    collisionRecoveryStateStartMs = 0;
    collisionReverseStartPulses = 0;
    collisionTriggerFrames = 0;
    collisionClearFrames = 0;
    collisionRecoveryColorId = 0;

    stopMotor();
    corridorReturnActive = false;
    wallEscapeState = WallEscapeState::BRAKING;
    wallEscapeStateStartMs = nowMs;
    commandServoAngle(static_cast<float>(SERVO_CENTER_DEGREES));

    Serial.print("PARED a ");
    Serial.print(frontDistanceMm / 10);
    Serial.println(" cm: frenando antes de retroceder");
  }

  if (!wallEscapeActive()) {
    return false;
  }

  commandServoAngle(static_cast<float>(SERVO_CENTER_DEGREES));

  const bool frontClear =
      validFrontDistance && frontDistanceMm >= WALL_ESCAPE_CLEAR_MM;
  if (frontClear) {
    stopMotor();
    wallEscapeState = WallEscapeState::IDLE;
    wallEscapeStateStartMs = 0;
    setMotorDirectionForward();
    resetMotorStartupDetection();
    resetCorridorPid();
    Serial.println("PARED liberada: termina el retroceso de escape");
    return false;
  }

  if (wallEscapeState == WallEscapeState::BRAKING) {
    if (nowMs - wallEscapeStateStartMs >= WALL_ESCAPE_BRAKE_MS) {
      wallEscapeState = WallEscapeState::REVERSING;
      wallEscapeStateStartMs = nowMs;
      setMotorReverseSpeedPercent(WALL_ESCAPE_REVERSE_SPEED_PERCENT);
      Serial.print("PARED: retroceso iniciado al ");
      Serial.print(WALL_ESCAPE_REVERSE_SPEED_PERCENT);
      Serial.println("%");
    }
    return true;
  }

  if (wallEscapeState == WallEscapeState::REVERSING) {
    if (nowMs - wallEscapeStateStartMs >=
        WALL_ESCAPE_MAX_REVERSE_MS) {
      stopMotor();
      wallEscapeState = WallEscapeState::WAITING_FOR_CLEAR;
      wallEscapeStateStartMs = nowMs;
      Serial.println(
          "PARED: limite de reversa alcanzado, motor detenido"
      );
    } else {
      setMotorReverseSpeedPercent(WALL_ESCAPE_REVERSE_SPEED_PERCENT);
    }
    return true;
  }

  // Si S3 nunca llega al umbral libre, permanece detenido de forma segura.
  stopMotor();
  return true;
}

// --------------------------- PID pasillo ----------------------------

float lateralDistanceForControl(uint16_t rawDistanceMm) {
  if (rawDistanceMm == INVALID_DISTANCE_MM ||
      rawDistanceMm > MAX_LATERAL_DISTANCE_MM) {
    return static_cast<float>(MAX_LATERAL_DISTANCE_MM);
  }

  return static_cast<float>(rawDistanceMm);
}

float calculateCornerFactor(uint16_t frontDistanceMm) {
  if (frontDistanceMm == INVALID_DISTANCE_MM ||
      frontDistanceMm >= FRONT_CORNER_START_MM) {
    return 0.0f;
  }

  if (frontDistanceMm <= FRONT_CORNER_CRITICAL_MM) {
    return 1.0f;
  }

  return static_cast<float>(FRONT_CORNER_START_MM - frontDistanceMm) /
         static_cast<float>(FRONT_CORNER_START_MM -
                            FRONT_CORNER_CRITICAL_MM);
}

uint8_t calculateMotorSpeed(float cornerFactor) {
  const float reduction =
      cornerFactor *
      static_cast<float>(MOTOR_SPEED_PERCENT -
                         MOTOR_CORNER_SPEED_PERCENT);

  return static_cast<uint8_t>(
      roundf(static_cast<float>(MOTOR_SPEED_PERCENT) - reduction)
  );
}

CorridorControlState calculateCorridorControl(
    const uint16_t distancesMm[SENSOR_COUNT]
) {
  const float s1 = lateralDistanceForControl(distancesMm[0]);
  const float s2 = lateralDistanceForControl(distancesMm[1]);
  const float s4 = lateralDistanceForControl(distancesMm[3]);
  const float s5 = lateralDistanceForControl(distancesMm[4]);

  CorridorControlState state;
  state.leftValue =
      s1 * SENSOR_WEIGHT_S1 + s2 * SENSOR_WEIGHT_S2;
  state.rightValue =
      s4 * SENSOR_WEIGHT_S4 + s5 * SENSOR_WEIGHT_S5;
  state.error = state.leftValue - state.rightValue;
  state.cornerFactor = calculateCornerFactor(distancesMm[2]);
  state.effectiveKp =
      CORRIDOR_KP *
      (1.0f +
       state.cornerFactor * (CORNER_KP_MULTIPLIER - 1.0f));

  const unsigned long nowUs = micros();
  float derivative = 0.0f;

  if (pidHasPreviousSample) {
    const float dtSeconds =
        static_cast<float>(nowUs - pidPreviousUpdateUs) / 1000000.0f;

    if (dtSeconds > 0.0f && dtSeconds <= 0.25f) {
      pidIntegralError += state.error * dtSeconds;

