RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
      if (CORRIDOR_KI > 0.0f) {
        const float integralLimitError =
            CORRIDOR_INTEGRAL_LIMIT_DEGREES / CORRIDOR_KI;
        pidIntegralError = constrain(
            pidIntegralError,
            -integralLimitError,
            integralLimitError
        );
      } else {
        pidIntegralError = 0.0f;
      }

      const float rawDerivative =
          (state.error - pidPreviousError) / dtSeconds;
      pidFilteredDerivative +=
          CORRIDOR_DERIVATIVE_FILTER *
          (rawDerivative - pidFilteredDerivative);
      derivative = pidFilteredDerivative;
    }
  } else {
    pidHasPreviousSample = true;
  }

  pidPreviousError = state.error;
  pidPreviousUpdateUs = nowUs;

  state.pTerm = state.effectiveKp * state.error;
  state.iTerm = constrain(
      CORRIDOR_KI * pidIntegralError,
      -CORRIDOR_INTEGRAL_LIMIT_DEGREES,
      CORRIDOR_INTEGRAL_LIMIT_DEGREES
  );
  state.dTerm = CORRIDOR_KD * derivative;

  float correctionDegrees =
      static_cast<float>(CORRIDOR_SERVO_DIRECTION) *
      (state.pTerm + state.iTerm + state.dTerm);
  correctionDegrees += parkingCorridorBiasDegrees();
  correctionDegrees = constrain(
      correctionDegrees,
      -static_cast<float>(SERVO_MAX_CORRECTION_DEGREES),
      static_cast<float>(SERVO_MAX_CORRECTION_DEGREES)
  );

  state.targetServoAngle = static_cast<int>(
      roundf(SERVO_CENTER_DEGREES + correctionDegrees)
  );
  state.appliedServoAngle = applyCorridorServoTarget(
      state.targetServoAngle
  );
  state.speedPercent = calculateMotorSpeed(state.cornerFactor);

  // Durante el estacionamiento se rueda despacio: aqui no se gana tiempo
  // y un error cuesta la maniobra entera.
  if (parkingIsMovingForward()) {
    state.speedPercent =
        min(state.speedPercent, parkingForwardSpeedCap());
  }

  setMotorSpeedPercent(state.speedPercent);

  return state;
}

float calculateCameraPillarProximity(const OpenMVData &data) {
  const int constrainedY = constrain(
      static_cast<int>(data.yReference),
      PILLAR_FAR_Y,
      PILLAR_NEAR_Y
  );

  return static_cast<float>(constrainedY - PILLAR_FAR_Y) /
         static_cast<float>(PILLAR_NEAR_Y - PILLAR_FAR_Y);
}

uint8_t calculatePillarMotorSpeed(
    const OpenMVData &data,
    uint16_t frontDistanceMm
) {
  const float cameraProximity = calculateCameraPillarProximity(data);
  const float frontProximity = calculateCornerFactor(frontDistanceMm);
  const float combinedProximity = max(cameraProximity, frontProximity);

  const float reduction =
      combinedProximity *
      static_cast<float>(MOTOR_PILLAR_FAR_SPEED_PERCENT -
                         MOTOR_CORNER_SPEED_PERCENT);

  return static_cast<uint8_t>(
      roundf(
          static_cast<float>(MOTOR_PILLAR_FAR_SPEED_PERCENT) - reduction
      )
  );
}

void updateMotorWhilePillarControls(
    const OpenMVData &data,
    const uint16_t distancesMm[SENSOR_COUNT]
) {
  uint8_t speedPercent =
      calculatePillarMotorSpeed(data, distancesMm[2]);

  if (frontGuardActive) {
    speedPercent = min(speedPercent, FRONT_GUARD_SPEED_PERCENT);
  }

  // El angulo se calcula antes de fijar la velocidad porque el limitador
  // lateral avisa, al calcularlo, que el robot va contra una pared.
  if (lockedPillarSeenBySideSensors) {
    speedPercent = min(speedPercent, PILLAR_WRAP_SPEED_PERCENT);
    const int wrapAngle = calculatePillarWrapServoAngle();

    if (sideWallGuardActive) {
      speedPercent = min(speedPercent, SIDE_WALL_SPEED_PERCENT);
    }

    commandServoAngle(static_cast<float>(wrapAngle));
    setMotorSpeedPercent(speedPercent);
    return;
  }

  const int pillarAngle = calculatePillarServoWithFrontGuard(data);

  if (sideWallGuardActive) {
    speedPercent = min(speedPercent, SIDE_WALL_SPEED_PERCENT);
  }

  commandServoAngle(static_cast<float>(pillarAngle));
  setMotorSpeedPercent(speedPercent);
}

// ------------------------- Comunicacion I2C -------------------------

bool sendLedBrightnessPercent(uint8_t percent) {
  percent = constrain(percent, 0, 100);

  Wire.beginTransmission(NANO_I2C_ADDRESS);
  Wire.write(percent);
  return Wire.endTransmission() == 0;
}

bool readDistancesMm(uint16_t outputMm[SENSOR_COUNT]) {
  const uint8_t received = Wire.requestFrom(
      static_cast<uint8_t>(NANO_I2C_ADDRESS),
      static_cast<uint8_t>(DISTANCE_PACKET_BYTES)
  );

  if (received != DISTANCE_PACKET_BYTES) {
    while (Wire.available()) {
      Wire.read();
    }
    return false;
  }

  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    const uint8_t lowByte = Wire.read();
    const uint8_t highByte = Wire.read();
    const uint16_t decodedDistance =
        static_cast<uint16_t>(lowByte) |
        (static_cast<uint16_t>(highByte) << 8);
    outputMm[i] = decodedDistance == INVALID_DISTANCE_MM
                      ? NO_ECHO_DISTANCE_MM
                      : decodedDistance;
  }

  return true;
}

// ----------------------- Intensidad proporcional --------------------

uint8_t calculateCameraLedBrightnessPercent(const OpenMVData &data) {
  const int constrainedY = constrain(
      static_cast<int>(data.yReference),
      PILLAR_FAR_Y,
      PILLAR_NEAR_Y
  );

  return static_cast<uint8_t>(
      map(
          constrainedY,
          PILLAR_FAR_Y,
          PILLAR_NEAR_Y,
          LED_BRIGHTNESS_FAR_PERCENT,
          LED_BRIGHTNESS_NEAR_PERCENT
      )
  );
}

uint8_t calculateFrontLedBrightnessPercent(uint16_t distanceMm) {
  const uint16_t constrainedDistance = constrain(
      distanceMm,
      LED_FRONT_NEAR_MM,
      LED_FRONT_FAR_MM
  );

  return static_cast<uint8_t>(
      map(
          constrainedDistance,
          LED_FRONT_NEAR_MM,
          LED_FRONT_FAR_MM,
          LED_BRIGHTNESS_NEAR_PERCENT,
          LED_BRIGHTNESS_FAR_PERCENT
      )
  );
}

bool hasFreshFrontDistance(unsigned long nowMs) {
  return latestFrontDistanceAtMs != 0 &&
         nowMs - latestFrontDistanceAtMs <= FRONT_DISTANCE_FRESH_MS &&
         latestFrontDistanceMm != INVALID_DISTANCE_MM;
}

uint8_t calculateCombinedLedBrightnessPercent(
    const OpenMVData &data,
    unsigned long nowMs
) {
  // S3 solo participa si la camara confirma que existe un pilar.
  const bool cameraTargetIsFresh =
      data.receivedAtMs != 0 &&
      nowMs - data.receivedAtMs <= OPENMV_TIMEOUT_MS &&
      !communicationTimedOut;

  if (!cameraTargetIsFresh || !hasValidPillarTarget(data)) {
    return LED_BRIGHTNESS_FAR_PERCENT;
  }

  const uint8_t cameraPercent =
      calculateCameraLedBrightnessPercent(data);

