RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
  if (!hasFreshFrontDistance(nowMs)) {
    return cameraPercent;
  }

  const uint8_t frontPercent =
      calculateFrontLedBrightnessPercent(latestFrontDistanceMm);

  // Menor porcentaje significa mayor cercania y mas atenuacion. Se usa
  // la estimacion mas cercana para evitar sobreexponer un pilar proximo.
  return min(cameraPercent, frontPercent);
}

void refreshLedBrightnessTarget() {
  // Estacionando manda la luz fija: el ajuste automatico la bajaria justo
  // cuando el robot tiene las paredes cerca, que es cuando mas falta hace.
  if (parkingActive()) {
    setLedBrightnessTarget(PARKING_LED_BRIGHTNESS_PERCENT);
    return;
  }

  setLedBrightnessTarget(
      calculateCombinedLedBrightnessPercent(openMVData, millis())
  );
}

bool applyLedBrightnessNow(uint8_t percent) {
  if (currentLedBrightnessPercent == percent) {
    return true;
  }

  if (!sendLedBrightnessPercent(percent)) {
    if (!ledI2cErrorReported) {
      ledI2cErrorReported = true;
      Serial.println("ERROR I2C: no se pudo actualizar los LEDs");
    }
    return false;
  }

  ledI2cErrorReported = false;
  currentLedBrightnessPercent = percent;
  return true;
}

void setLedBrightnessTarget(uint8_t percent) {
  targetLedBrightnessPercent = constrain(percent, 0, 100);
}

void serviceLedBrightnessTransition() {
  if (currentLedBrightnessPercent < 0) {
    applyLedBrightnessNow(targetLedBrightnessPercent);
    return;
  }

  if (targetLedBrightnessPercent < currentLedBrightnessPercent) {
    applyLedBrightnessNow(targetLedBrightnessPercent);
    return;
  }

  if (targetLedBrightnessPercent == currentLedBrightnessPercent) {
    return;
  }

  const unsigned long nowMs = millis();
  if (nowMs - lastLedReturnStepMs < LED_RETURN_INTERVAL_MS) {
    return;
  }

  lastLedReturnStepMs = nowMs;
  const int nextPercent = min(
      currentLedBrightnessPercent + LED_RETURN_STEP_PERCENT,
      targetLedBrightnessPercent
  );
  applyLedBrightnessNow(static_cast<uint8_t>(nextPercent));
}

// ------------------- Estacionamiento final ---------------------------

bool parkingActive() {
  return parkingState != ParkingState::IDLE &&
         parkingState != ParkingState::DONE;
}

const char *parkingStateText() {
  switch (parkingState) {
    case ParkingState::SEARCH: return "buscando paredes";
    case ParkingState::PASSING: return "rebasando paredes";
    case ParkingState::ALIGNING: return "avance final al hueco";
    case ParkingState::BRAKING: return "frenando";
    case ParkingState::REVERSE_TURN: return "entrando de reversa";
    case ParkingState::REVERSE_STRAIGHT: return "enderezando";
    case ParkingState::DONE:
      return parkingSucceeded ? "estacionado" : "SIN ESTACIONAR";
    default: return "sin iniciar";
  }
}

void setParkingState(ParkingState nextState, const unsigned long nowMs) {
  parkingState = nextState;
  parkingStateStartMs = nowMs;
  parkingPhaseStartPulses = readEncoderPulseCount();

  Serial.print("ESTACIONAMIENTO: ");
  Serial.println(parkingStateText());
}

float parkingPhaseDistanceMm() {
  const uint32_t pulses =
      readEncoderPulseCount() - parkingPhaseStartPulses;
  return static_cast<float>(pulses) * ENCODER_MM_PER_PULSE;
}

// Fases en las que el robot todavia avanza y el pasillo sigue mandando.
bool parkingIsMovingForward() {
  return parkingState == ParkingState::SEARCH ||
         parkingState == ParkingState::PASSING ||
         parkingState == ParkingState::ALIGNING;
}

uint8_t parkingForwardSpeedCap() {
  // Mientras no haya visto nada, buscar rapido. Con la pared a la vista, la
  // precision importa mas que el tiempo.
  if (parkingState == ParkingState::SEARCH) {
    return PARKING_SEARCH_SPEED_PERCENT;
  }

  return PARKING_APPROACH_SPEED_PERCENT;
}

// El servo se manda en grados respecto al centro, hacia el lado del hueco.
// parkingSide vale +1 a la derecha y -1 a la izquierda; CORRIDOR_SERVO_DIRECTION
// ya trae calibrado que signo de servo corresponde a cada lado.
int parkingServoTowardGap(int correctionDegrees) {
  if (parkingSide == 0) {
    return SERVO_CENTER_DEGREES;
  }

  // Girar hacia la izquierda es el signo CORRIDOR_SERVO_DIRECTION; hacia la
  // derecha, el contrario.
  const int leftSign = CORRIDOR_SERVO_DIRECTION;
  const int towardGapSign = (parkingSide < 0) ? leftSign : -leftSign;

  return constrain(
      SERVO_CENTER_DEGREES + towardGapSign * correctionDegrees,
      SERVO_CENTER_DEGREES - SERVO_MAX_CORRECTION_DEGREES,
      SERVO_CENTER_DEGREES + SERVO_MAX_CORRECTION_DEGREES
  );
}

// Sesgo que se suma a la correccion del PID para arrimarse al lado del
// hueco. Acorta la maniobra de reversa sin soltar el seguimiento de pared.
float parkingCorridorBiasDegrees() {
  if (!parkingIsMovingForward() || parkingSide == 0) {
    return 0.0f;
  }

  const int leftSign = CORRIDOR_SERVO_DIRECTION;
  const int towardGapSign = (parkingSide < 0) ? leftSign : -leftSign;

  return static_cast<float>(
      towardGapSign * PARKING_SIDE_BIAS_DEGREES
  );
}

void finishParking(const char *reason, const unsigned long nowMs) {
  parkingFinishReason = reason;
  stopMotor();
  commandServoAngle(static_cast<float>(SERVO_CENTER_DEGREES));
  setParkingState(ParkingState::DONE, nowMs);

  missionComplete = true;
  completedLaps = TARGET_LAPS;
  if (roundTimerStarted) {
    roundFinishMs = millis();
  }

  Serial.print("*** ESTACIONAMIENTO TERMINADO: ");
  Serial.print(reason);
  Serial.println(" ***");
}

void beginParking(const unsigned long nowMs) {
  if (parkingState != ParkingState::IDLE) {
    return;
  }

  clearPillarLock("inicio del estacionamiento");
  collisionRecoveryState = CollisionRecoveryState::IDLE;
  collisionRecoveryStateStartMs = 0;
  collisionReverseStartPulses = 0;
  collisionTriggerFrames = 0;
  collisionClearFrames = 0;
  collisionRecoveryColorId = 0;
  resetCorridorPid();

  parkingStartedMs = nowMs;
  parkingSucceeded = false;
  parkingFinishReason = "";
  parkingSide = 0;
  parkingWallsPassed = 0;
  parkingSeenFrames = 0;
  parkingLostFrames = 0;
  parkingWallInSight = false;

  // El hueco esta en la pared EXTERIOR, y de que lado queda esa pared se
  // sabe por el sentido de la vuelta. Fijarlo aqui, y no al final, hace que
  // el sesgo lateral arrime al robot a esa pared mientras busca: la camara
  // barre justo donde tiene que estar el estacionamiento.
  //
  // La camara lo corrige despues si resulta estar del otro lado.
  if (PARKING_SIDE_FROM_TURN_FALLBACK &&
      fabsf(accumulatedTurnDegrees) >= DEGREES_PER_LAP) {
    const bool counterClockwise =
        (accumulatedTurnDegrees > 0.0f) == (PARKING_CCW_YAW_SIGN > 0);
    parkingSide = counterClockwise ? 1 : -1;

    Serial.print("ESTACIONAMIENTO: se busca pegado a la pared ");
    Serial.println(parkingSide > 0 ? "DERECHA" : "IZQUIERDA");
  }

  setParkingState(ParkingState::SEARCH, nowMs);

  // Luz alta desde el primer instante de la busqueda, para que el magenta se
  // vea como se calibro.
  setLedBrightnessTarget(PARKING_LED_BRIGHTNESS_PERCENT);

  Serial.print(
      "*** VUELTAS COMPLETAS: empieza la busqueda del estacionamiento, luz al "
  );
  Serial.print(PARKING_LED_BRIGHTNESS_PERCENT);
  Serial.println("% ***");
}

