RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Cuenta paredes con histeresis: una pared se da por vista tras varias tramas
// seguidas y por rebasada tras varias sin ella. Asi un parpadeo no suma.
void updateParkingWallCount(const OpenMVData &data) {
  const bool wallVisible =
      data.parkingDetected != 0 && data.parkingArea >= PARKING_MIN_AREA;

  if (wallVisible) {
    parkingLostFrames = 0;

    if (!parkingWallInSight) {
      if (parkingSeenFrames < 255) {
        ++parkingSeenFrames;
      }

      if (parkingSeenFrames >= PARKING_SEEN_FRAMES) {
        parkingWallInSight = true;
        parkingSeenFrames = 0;

        // La camara dice de que lado estan las paredes. Es evidencia directa
        // y no depende del convenio de signos del BNO085.
        if (parkingSide == 0 && data.parkingX != 0) {
          parkingSide = (data.parkingX > 0) ? 1 : -1;
          Serial.print("ESTACIONAMIENTO: hueco a la ");
          Serial.println(parkingSide > 0 ? "DERECHA" : "IZQUIERDA");
        }

        Serial.print("ESTACIONAMIENTO: pared a la vista, X=");
        Serial.println(data.parkingX);
      }
    }
    return;
  }

  parkingSeenFrames = 0;

  if (!parkingWallInSight) {
    return;
  }

  if (parkingLostFrames < 255) {
    ++parkingLostFrames;
  }

  if (parkingLostFrames >= PARKING_LOST_FRAMES) {
    parkingWallInSight = false;
    parkingLostFrames = 0;
    ++parkingWallsPassed;

    Serial.print("ESTACIONAMIENTO: pared rebasada ");
    Serial.print(parkingWallsPassed);
    Serial.print("/");
    Serial.println(PARKING_WALLS_TO_PASS);
  }
}

// Confirma con los ultrasonicos que el costado del hueco esta despejado. Es
// la comprobacion que la camara no puede dar: cuando el robot llega a la
// altura del hueco, las paredes ya salieron de su campo de vision.
bool parkingGapConfirmedBySensors() {
  if (parkingSide == 0) {
    return false;
  }

  if (latestFrontDistanceAtMs == 0 ||
      millis() - latestFrontDistanceAtMs > SENSOR_FAILSAFE_TIMEOUT_MS) {
    return false;
  }

  const uint16_t sideMm =
      nearestSideDistanceMm(parkingSide < 0, latestDistancesMm);

  return sideMm != INVALID_DISTANCE_MM && sideMm >= PARKING_GAP_SIDE_MM;
}

void serviceParking(const unsigned long nowMs) {
  if (!parkingActive()) {
    return;
  }

  // Sin ultrasonicos el robot no puede ni seguir el pasillo ni confirmar el
  // hueco: seguir "buscando" 70 segundos es fingir que trabaja. Se corta ya y
  // se dice por que, que es lo unico util en ese momento.
  if (lastValidSensorMs != 0 &&
      nowMs - lastValidSensorMs >= PARKING_SENSOR_MUTE_ABORT_MS) {
    finishParking("SIN SENSORES I2C: el Nano dejo de responder", nowMs);
    return;
  }

  if (nowMs - parkingStartedMs >= PARKING_TOTAL_MAX_MS) {
    // Sin camara no hay estacionamiento posible: conviene decirlo aqui, que
    // es donde se nota, y no dejarlo como un "se acabo el tiempo" a secas.
    if (communicationTimedOut || openMVData.receivedAtMs == 0) {
      finishParking("se agoto el tiempo SIN DATOS DE LA CAMARA", nowMs);
    } else if (parkingWallsPassed == 0) {
      finishParking("se agoto el tiempo sin ver ninguna pared", nowMs);
    } else {
      finishParking("se agoto el tiempo a medias", nowMs);
    }
    return;
  }

  const unsigned long phaseMs = nowMs - parkingStateStartMs;

  switch (parkingState) {
    case ParkingState::SEARCH: {
      // Sigue el pasillo normal, mas despacio, hasta ver la primera
      // pared. El tope de velocidad se aplica sobre el PID de pasillo.
      if (parkingWallInSight || parkingWallsPassed > 0) {
        setParkingState(ParkingState::PASSING, nowMs);
      }
      return;
    }

    case ParkingState::PASSING: {
      // El volante lo sigue llevando el PID de pasillo, con un sesgo
      // hacia el lado del hueco: soltar el seguimiento de pared aqui
      // dejaria al robot a la deriva justo al lado de la pared.
      if (parkingWallsPassed >= PARKING_WALLS_TO_PASS) {
        setParkingState(ParkingState::ALIGNING, nowMs);
      }
      return;
    }

    case ParkingState::ALIGNING: {
      // Ultima oportunidad de saber el lado: si la camara nunca lo dijo,
      // se deduce del sentido de la vuelta.
      if (parkingSide == 0 && PARKING_SIDE_FROM_TURN_FALLBACK &&
          fabsf(accumulatedTurnDegrees) >= DEGREES_PER_LAP) {
        const bool counterClockwise =
            (accumulatedTurnDegrees > 0.0f) ==
            (PARKING_CCW_YAW_SIGN > 0);
        parkingSide = counterClockwise ? 1 : -1;

        Serial.print("ESTACIONAMIENTO: lado deducido del giro -> ");
        Serial.println(parkingSide > 0 ? "DERECHA" : "IZQUIERDA");
      }

      const bool distanceReached =
          parkingPhaseDistanceMm() >=
          static_cast<float>(PARKING_PASS_DISTANCE_MM);

      if (distanceReached || parkingGapConfirmedBySensors() ||
          phaseMs >= PARKING_PHASE_MAX_MS) {
        stopMotor();

        // Sin saber de que lado esta el hueco, entrar de reversa seria
        // adivinar: mejor quedarse quieto que meterse contra una pared.
        if (parkingSide == 0) {
          finishParking("no se identifico el lado del hueco", nowMs);
          return;
        }

        setParkingState(ParkingState::BRAKING, nowMs);
      }
      return;
    }

    case ParkingState::BRAKING: {
      stopMotor();

      // El volante se preposiciona mientras el robot todavia se detiene.
      commandServoAngle(
          static_cast<float>(
              parkingServoTowardGap(PARKING_REVERSE_STEER_DEGREES)
          )
      );

      if (phaseMs >= PARKING_BRAKE_MS) {
        setParkingState(ParkingState::REVERSE_TURN, nowMs);
      }
      return;
    }

    case ParkingState::REVERSE_TURN: {
      // En reversa la geometria invierte el efecto del volante, asi que para
      // meter la cola en el hueco las ruedas apuntan al lado contrario.
      commandServoAngle(
          static_cast<float>(
              parkingServoTowardGap(-PARKING_REVERSE_STEER_DEGREES)
          )
      );
      setMotorReverseSpeedPercent(PARKING_REVERSE_SPEED_PERCENT);

      if (parkingPhaseDistanceMm() >=
              static_cast<float>(PARKING_REVERSE_TURN_MM) ||
          phaseMs >= PARKING_PHASE_MAX_MS) {
        setParkingState(ParkingState::REVERSE_STRAIGHT, nowMs);
      }
      return;
    }

    case ParkingState::REVERSE_STRAIGHT: {
      commandServoAngle(
          static_cast<float>(
              parkingServoTowardGap(PARKING_STRAIGHTEN_STEER_DEGREES)
          )
      );
      setMotorReverseSpeedPercent(PARKING_REVERSE_SPEED_PERCENT);

      if (parkingPhaseDistanceMm() >=
              static_cast<float>(PARKING_REVERSE_STRAIGHT_MM) ||
          phaseMs >= PARKING_PHASE_MAX_MS) {
        parkingSucceeded = true;
        finishParking("dentro del cajon", nowMs);
      }
      return;
    }

    default:
      return;
  }
}

// ----------------------- Recepcion no bloqueante --------------------

void printOpenMVPacket(const OpenMVData &data, int servoAngle) {
  Serial.print("OpenMV ID=");
  Serial.print(data.detectedId);
  Serial.print(" X=");
  Serial.print(data.xReference);
  Serial.print(" Y=");
  Serial.print(data.yReference);
  Serial.print(" ROI=");
  Serial.print(data.roiCode);
  Serial.print(" COL=");
  Serial.print(data.collisionId);
  Serial.print(" W=");
  Serial.print(data.wallBlack);
  if (data.parkingDetected) {
    Serial.print(" | ESTACIONAMIENTO X=");
    Serial.print(data.parkingX);
    Serial.print(" area=");
    Serial.print(data.parkingArea);
  }
  if (sideWallGuardActive) {
    Serial.print(" | PARED_LATERAL a ");
    Serial.print(sideWallGuardDistanceMm / 10);
    Serial.print(" cm");
  }
  Serial.print(" | control=");

  if (wallEscapeActive()) {
    Serial.println("ESCAPE_PARED");
  } else if (collisionRecoveryActive()) {
    Serial.println("RECUPERACION_COLISION");
  } else if (pillarLockActive && pillarHasSteeringControl &&
             lockedPillarSeenBySideSensors) {
    Serial.print("RODEO_PILAR servo=");
    Serial.println(servoAngle);
  } else if (pillarLockActive && pillarHasSteeringControl) {
    Serial.print("PILAR_ENCLAVADO servo=");
    Serial.println(servoAngle);
  } else if (pillarLockActive) {
    Serial.println("DESPEJE_PILAR");
  } else if (corridorReturnActive) {
    Serial.println("RETORNO_GRADUAL");
  } else {
    Serial.println("PASILLO");
  }
}

