RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Los avisos se agrupan: imprimir cada trama mala a 115200 baudios llena
// el buffer de Serial, y ahi Serial.print bloquea el loop completo.
void reportInvalidOpenMVLine(const char *line) {
  ++invalidFrameCount;
  ++totalInvalidFrames;

  const unsigned long nowMs = millis();
  if (lastInvalidFrameLogMs != 0 &&
      nowMs - lastInvalidFrameLogMs < OPENMV_INVALID_LOG_INTERVAL_MS) {
    return;
  }
  lastInvalidFrameLogMs = nowMs;

  Serial.print("TRAMA OpenMV DESCARTADA (");
  Serial.print(invalidFrameCount);
  Serial.print(" desde el ultimo aviso): ");
  Serial.println(line);
  invalidFrameCount = 0;
}

// Suelta el pilar enclavado cuando ya no se ve y la camara insiste con uno
// de otro color. Sin esto el robot sigue dirigiendo hacia las coordenadas
// viejas del anterior, que es lo que lo mete contra la pared al pasar de
// verde a rojo.
void updatePillarSwitchRequest(const OpenMVData &data) {
  if (!pillarLockActive) {
    pillarSwitchFrames = 0;
    return;
  }

  const bool otherPillarVisible =
      hasValidPillarTarget(data) && data.detectedId != lockedPillarId;

  if (!otherPillarVisible) {
    pillarSwitchFrames = 0;
    return;
  }

  const unsigned long staleLimitMs = lockedPillarSeenBySideSensors
      ? PILLAR_SWITCH_WRAP_STALE_MS
      : PILLAR_SWITCH_STALE_MS;

  // Si el enclavado sigue apareciendo, el rebase esta en curso y no se
  // abandona por mucho que asome el siguiente.
  if (data.receivedAtMs - lastLockedPillarSeenMs < staleLimitMs) {
    pillarSwitchFrames = 0;
    return;
  }

  if (++pillarSwitchFrames < PILLAR_SWITCH_CONFIRM_FRAMES) {
    return;
  }

  Serial.print("Cambio de pilar: aparece ");
  Serial.print(data.detectedId == 3 ? "VERDE" : "ROJO");
  Serial.print(" y el ");
  Serial.print(lockedPillarId == 3 ? "VERDE" : "ROJO");
  Serial.println(" enclavado ya no se ve");

  clearPillarLock("otro pilar a la vista y el anterior perdido");
}

void processCompleteLine() {
  rxBuffer[rxLength] = '\0';

  OpenMVData newData;
  if (parseOpenMVLine(rxBuffer, newData)) {
    openMVData = newData;
    communicationTimedOut = false;

    // El conteo de paredes corre a ritmo de camara, no de sensores.
    if (parkingActive()) {
      updateParkingWallCount(openMVData);
    }

    // Con el estacionamiento en marcha nada mas puede tomar el mando: ni
    // una colision de color ni un cambio de pilar deben interrumpir la
    // maniobra a medias.
    if (parkingActive()) {
      refreshLedBrightnessTarget();
      printOpenMVPacket(openMVData, lastWrittenServoAngle);
      rxLength = 0;
      return;
    }

    int servoAngle = lastWrittenServoAngle;
    const bool validTarget = hasValidPillarTarget(openMVData);

    if (handleCollisionPacket(openMVData)) {
      refreshLedBrightnessTarget();
      printOpenMVPacket(openMVData, SERVO_CENTER_DEGREES);
      rxLength = 0;
      return;
    }

    // Se evalua antes de enclavar para que el pilar nuevo pueda tomar el
    // mando en esta misma trama, sin un ciclo perdido dirigiendo a ciegas.
    updatePillarSwitchRequest(openMVData);

    if (!pillarLockActive && validTarget) {
      beginPillarLock(openMVData);
    }

    if (pillarLockActive && validTarget &&
        openMVData.detectedId == lockedPillarId &&
        !lockedPillarSeenBySideSensors) {
      lockedPillarData = openMVData;
      lockedPillarReachedLowRoi =
          lockedPillarReachedLowRoi || openMVData.roiCode == 2;
      lastLockedPillarSeenMs = openMVData.receivedAtMs;
      takePillarSteeringControl();
      servoAngle = commandServoAngle(
          static_cast<float>(
              calculatePillarServoWithFrontGuard(openMVData)
          )
      );
    }

    refreshLedBrightnessTarget();
    printOpenMVPacket(openMVData, servoAngle);
  } else {
    reportInvalidOpenMVLine(rxBuffer);
  }

  rxLength = 0;
}

// Si el loop se retraso, la camara siguio enviando y el buffer guarda
// imagenes viejas. Se tiran para dirigir siempre con la mas reciente.
void discardStaleOpenMVBacklog() {
  if (openMVSerial.available() <= OPENMV_MAX_BACKLOG_BYTES) {
    return;
  }

  bool endedOnNewline = false;
  while (openMVSerial.available() > OPENMV_MAX_BACKLOG_BYTES) {
    endedOnNewline =
        (static_cast<char>(openMVSerial.read()) == '\n');
  }

  rxLength = 0;
  // Si el corte quedo a mitad de una linea se ignora lo que resta de ella,
  // porque media trama con comas todavia parece valida.
  discardingLongLine = !endedOnNewline;

  reportInvalidOpenMVLine("atraso descartado: loop lento");
}

void readOpenMV() {
  discardStaleOpenMVBacklog();

  uint8_t linesProcessed = 0;

  while (openMVSerial.available() > 0) {
    const char character = static_cast<char>(openMVSerial.read());

    if (character == '\n') {
      if (discardingLongLine) {
        discardingLongLine = false;
        rxLength = 0;
        reportInvalidOpenMVLine("linea demasiado larga o incompleta");
      } else if (rxLength > 0) {
        processCompleteLine();

        // El resto espera a la siguiente vuelta: los sensores y el servo
        // no pueden quedarse esperando a que se vacie una rafaga.
        if (++linesProcessed >= OPENMV_MAX_LINES_PER_LOOP) {
          return;
        }
      }
      continue;
    }

    // El nulo y el retorno de carro no rompen la linea en curso.
    if (character == '\r' || character == '\0' || discardingLongLine) {
      continue;
    }

    if (rxLength < RX_BUFFER_SIZE - 1) {
      rxBuffer[rxLength++] = character;
    } else {
      rxLength = 0;
      discardingLongLine = true;
    }
  }
}

void applyOpenMVCommunicationFailsafe() {
  if (openMVData.receivedAtMs == 0 ||
      millis() - openMVData.receivedAtMs <= OPENMV_TIMEOUT_MS) {
    return;
  }

  if (!communicationTimedOut) {
    communicationTimedOut = true;
    clearPillarLock("timeout de comunicacion OpenMV");
    setLedBrightnessTarget(LED_BRIGHTNESS_FAR_PERCENT);
    Serial.println(
        "TIMEOUT OpenMV: regreso gradual al control de pasillo"
    );
  }
}

// -------------------------- Depuracion -------------------------------

void printDistances(const uint16_t distancesMm[SENSOR_COUNT]) {
  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    Serial.print("S");
    Serial.print(i + 1);
    Serial.print("=");

    if (distancesMm[i] == INVALID_DISTANCE_MM) {
      Serial.print("sin eco");
    } else {
      Serial.print(distancesMm[i] / 10);
      Serial.print(".");
      Serial.print(distancesMm[i] % 10);
      Serial.print("cm");
    }

    if (i < SENSOR_COUNT - 1) {
      Serial.print(" | ");
    }
  }
  Serial.println();
}

void printCorridorControl(const CorridorControlState &state) {
  Serial.print("Pasillo error=");
  Serial.print(state.error, 1);
  Serial.print(" P=");
  Serial.print(state.pTerm, 1);
  Serial.print(" I=");
  Serial.print(state.iTerm, 1);
  Serial.print(" D=");
  Serial.print(state.dTerm, 1);
  Serial.print(" | objetivo=");
  Serial.print(state.targetServoAngle);
  Serial.print(" aplicado=");
  Serial.print(state.appliedServoAngle);
  Serial.print(" | modo=");
  Serial.print(corridorReturnActive ? "RETORNO" : "PASILLO");
  Serial.print(" | motor=");
  Serial.print(state.speedPercent);
  Serial.print("% | luz=");
  Serial.print(currentLedBrightnessPercent);
  Serial.print("% objetivo=");
  Serial.print(targetLedBrightnessPercent);
  Serial.println("%");
}

