RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Obstaculos_V2.ino
// Durante las vueltas la camara NO debe buscar paredes de estacionamiento:
// vistas de canto parecen pilares y el robot se iba directo contra ellas.
void sendOpenMVParkingMode(const unsigned long nowMs) {
  static unsigned long lastSentMs = 0;
  static bool lastSentEnabled = false;
  static bool everSent = false;

  const bool enabled = OPENMV_PARKING_ALWAYS_SEARCH || parkingActive();

  const bool changed = !everSent || enabled != lastSentEnabled;
  if (!changed &&
      nowMs - lastSentMs < OPENMV_PARKING_MODE_INTERVAL_MS) {
    return;
  }

  lastSentMs = nowMs;
  lastSentEnabled = enabled;
  everSent = true;

  openMVSerial.print("P,");
  openMVSerial.print(enabled ? 1 : 0);
  openMVSerial.print('\n');

  if (changed) {
    Serial.print("ESTACIONAMIENTO: se avisa a la camara -> ");
    Serial.println(enabled ? "BUSCAR paredes" : "ignorar paredes");
  }
}

void sendOpenMVPathTelemetry(const unsigned long nowMs) {
  static unsigned long lastTelemetryMs = 0;

  if (!OPENMV_PATH_TELEMETRY_ENABLED ||
      nowMs - lastTelemetryMs < OPENMV_PATH_TELEMETRY_INTERVAL_MS) {
    return;
  }
  lastTelemetryMs = nowMs;

  const int servoAngle = lastWrittenServoAngle >= 0
                             ? lastWrittenServoAngle
                             : SERVO_CENTER_DEGREES;

  // Formato: T,servo,motor,S1,S2,S3,S4,S5\n
  openMVSerial.print("T,");
  openMVSerial.print(servoAngle);
  openMVSerial.print(',');
  openMVSerial.print(appliedMotorSpeedPercent);
  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    openMVSerial.print(',');
    openMVSerial.print(latestDistancesMm[i]);
  }
  openMVSerial.print('\n');
}

// ----------------------------- Arduino -------------------------------

void setup() {
  Serial.begin(115200);
  beginEncoder();

  Wire.begin(
      ESP32_SDA_PIN,
      ESP32_SCL_PIN,
      I2C_FREQUENCY_HZ
  );
  Wire.setTimeOut(I2C_TIMEOUT_MS);
  beginBno085I2c();

  // Debe pedirse antes de begin() para que el driver lo reserve.
  openMVSerial.setRxBufferSize(OPENMV_RX_HARDWARE_BUFFER_BYTES);
  openMVSerial.begin(
      OPENMV_BAUD,
      SERIAL_8N1,
      OPENMV_RX_PIN,
      OPENMV_TX_PIN
  );

  // Lo que llego mientras arrancaba el ESP32 casi siempre es media trama.
  delay(5);
  while (openMVSerial.available() > 0) {
    openMVSerial.read();
  }
  rxLength = 0;
  discardingLongLine = false;

  servoReady = beginServoPwm();
  if (servoReady) {
    commandServoAngle(SERVO_CENTER_DEGREES);
  }

  motorReady = beginMotorPwm();
  if (motorReady) {
    stopMotor();
  }

  lastValidSensorMs = millis();

  delay(10);
  const bool ledsConfigured =
      applyLedBrightnessNow(LED_BRIGHTNESS_FAR_PERCENT);
  beginDashboard();

  Serial.println();
  Serial.println("ESP32 obstaculos V2 + pasillo + BNO085");
  Serial.print("OpenMV UART2 RX=");
  Serial.print(OPENMV_RX_PIN);
  Serial.print(" TX=");
  Serial.print(OPENMV_TX_PIN);
  Serial.print(" @ ");
  Serial.print(OPENMV_BAUD);
  Serial.print(" baudios; tramas de ");
  Serial.print(OPENMV_MIN_FIELDS);
  Serial.print(" o mas campos, X ");
  Serial.println(
      OPENMV_X_IS_NORMALIZED ? "normalizada" : "en pixeles"
  );
  Serial.println(
      "Prioridad: PILAR -> RETORNO GRADUAL -> PASILLO"
  );
  Serial.print("Retorno al pasillo: ");
  Serial.print(CORRIDOR_RETURN_RATE_DEGREES_PER_SECOND, 1);
  Serial.println(" grados/segundo");

  if (!servoReady) {
    Serial.println("ERROR: no se pudo iniciar el PWM del servo");
  }
  if (!motorReady) {
    Serial.println("ERROR: no se pudo iniciar el PWM del motor");
  }
  if (!ledsConfigured) {
    Serial.println("ERROR I2C: no se pudo configurar los LEDs");
  }

  Serial.println(
      "Motor detenido; arrancara al recibir sensores validos"
  );
  Serial.print("Encoder A=D5, B=D9; PWM inicial=");
  Serial.print(MOTOR_START_DETECTION_PERCENT);
  Serial.println("%");
}

void loop() {
  updateDashboard();
  if (missionComplete) {
    return;
  }

  readOpenMV();
  applyOpenMVCommunicationFailsafe();
  serviceLedBrightnessTransition();

  static unsigned long lastPollMs = 0;
  static unsigned long lastPrintMs = 0;

  const unsigned long nowMs = millis();
  updateBno085(nowMs);
  updateOdometry();

  if (lapTrackingActive && bno085Initialized && bno085HasHeading &&
      nowMs - lastBno085FrameMs >= BNO085_FAILSAFE_TIMEOUT_MS &&
      !bno085FailsafeActive) {
    bno085FailsafeActive = true;
    Serial.println("AVISO: se perdio el rumbo del BNO085");
  }

  if (missionComplete) {
    return;
  }

  if (REQUIRE_BNO085_TO_MOVE &&
      (!bno085HasHeading || bno085FailsafeActive)) {
    if (targetMotorSpeedPercent > 0 || appliedMotorSpeedPercent > 0) {
      stopMotor();
    }
    return;
  }

  if (!wallEscapeActive()) {
    serviceCollisionRecovery(nowMs);
  }

  serviceParking(nowMs);

  // El Nano lleva mudo demasiado: se reinicia el bus por si quedo trabado.
  if (lastValidSensorMs != 0 &&
      nowMs - lastValidSensorMs >= I2C_RECOVERY_INTERVAL_MS &&
      nowMs - lastI2cRecoveryMs >= I2C_RECOVERY_INTERVAL_MS) {
    lastI2cRecoveryMs = nowMs;
    Serial.println("I2C: sensores mudos, se reinicia el bus");
    Wire.end();
    Wire.begin(ESP32_SDA_PIN, ESP32_SCL_PIN, I2C_FREQUENCY_HZ);
    Wire.setTimeOut(I2C_TIMEOUT_MS);
  }

  if (nowMs - lastPollMs >= SENSOR_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;

    uint16_t distancesMm[SENSOR_COUNT];
    if (readDistancesMm(distancesMm)) {
      lastValidSensorMs = nowMs;
      distanceSensorFailsafeActive = false;
      for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
        latestDistancesMm[i] = distancesMm[i];
      }
      latestFrontDistanceMm = distancesMm[2];
      latestFrontDistanceAtMs = nowMs;
      refreshLedBrightnessTarget();
      const bool escapingWall =
          (parkingActive() && !parkingIsMovingForward())
              ? false
              : updateWallEscape(distancesMm[2], nowMs);

      if (!escapingWall) {
        updateFrontGuard(distancesMm[2]);
      } else {
        resetFrontGuard();
      }

      if (!escapingWall && !collisionRecoveryActive()) {
        updatePillarDistanceHandoff(distancesMm, nowMs);
      }

      if (escapingWall) {
        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          Serial.print("Control=ESCAPE_PARED | servo=");
          Serial.print(lastWrittenServoAngle);
          Serial.print(" | motor=");
          Serial.print(appliedMotorSpeedPercent);
          Serial.println("%");
        }
      } else if (collisionRecoveryActive()) {
        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          Serial.print("Control=RECUPERACION_COLISION | servo=");
          Serial.print(lastWrittenServoAngle);
          Serial.print(" | motor=");
          Serial.print(targetMotorSpeedPercent);
          Serial.println("%");
        }
      } else if (parkingActive() && !parkingIsMovingForward()) {
        // Solo al frenar y entrar de reversa la maniobra toma el mando.
        // Mientras avanza sigue mandando el PID de pasillo, con el sesgo
        // y el tope de velocidad del estacionamiento.
        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          Serial.print("Control=ESTACIONAMIENTO ");
          Serial.print(parkingStateText());
          Serial.print(" | servo=");
          Serial.print(lastWrittenServoAngle);
          Serial.print(" | paredes=");
          Serial.print(parkingWallsPassed);
          Serial.print("/");
          Serial.println(PARKING_WALLS_TO_PASS);
        }
      } else if (pillarHasSteeringControl) {
        // Los sensores no tocan el servo mientras exista un pilar.
        updateMotorWhilePillarControls(lockedPillarData, distancesMm);

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          Serial.print("Control=PILAR | servo=");
          Serial.print(lastWrittenServoAngle);
          Serial.print(" | motor=");
          Serial.print(targetMotorSpeedPercent);
          Serial.print("% | proteccion_frontal=");
          Serial.print(frontGuardActive ? "SI" : "no");
          Serial.print(" | luz=");
          Serial.print(currentLedBrightnessPercent);
          Serial.print("% objetivo=");
          Serial.print(targetLedBrightnessPercent);
          Serial.println("%");
        }
      } else {
        const CorridorControlState state =
            calculateCorridorControl(distancesMm);

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          printCorridorControl(state);
        }
      }
    }
  }

  serviceMotorSoftStart(nowMs);

  sendOpenMVParkingMode(nowMs);
  sendOpenMVPathTelemetry(nowMs);

  // Durante la reversa del estacionamiento no hay sensores que mirar
  // hacia atras: la maniobra ya esta acotada por encoder y por tiempo.
  if (!parkingActive() && targetMotorSpeedPercent > 0 &&
      nowMs - lastValidSensorMs >= SENSOR_FAILSAFE_TIMEOUT_MS) {
    stopMotor();

    if (!distanceSensorFailsafeActive) {
      distanceSensorFailsafeActive = true;
      Serial.println("Motor detenido: sin datos I2C de sensores");
    }
  }
}
